[
  "There is no fun fact here.",
  "you're short.",
  "I love you.",
  "i forgor",
  "i rember :D",
  "amimir",
  "On average people fear spiders more than they do death.",
  "A crocodile cannot stick its tongue out.",
  "Table tennis balls have been known to travel off the paddle at speeds up to 160 km/hr. ",
  "'Go.' is the shortest complete sentence in the English language.",
  "A snail can sleep for three years.",
  "No word in the English language rhymes with 'MONTH'",
  "The volume of the earth's moon is the same as the volume of the Pacific Ocean. ",
  "A cow has to eat grass to produce milk and grass is living.",
  "The cigarette lighter was invented before the match.",
  "The house fly hums in the middle octave key of F.",
  "Hydrogen gas is the least dense substance in the world, at 0.08988g/cc.",
  "The only capital letter in the Roman alphabet with exactly one end point is P. ",
  "Tigers have striped skin, not just striped fur. ",
  "A cat's jaw cannot move sideways.",
  "Hummingbirds are the only animals that can fly backwards. ",
  "If you yelled for 8 years, 7 months and 6 days you would have produced enough sound energy to heat one cup of coffee. (Hardly seems worth it)",
  "If you passed gas consistently for 6 years and 9 months, enough gas is produced to create the energy of an atomic bomb.",
  "The human heart creates enough pressure when it pumps out to the body to squirt blood 30 feet.",
  "A pig's orgasm lasts 30 minutes. (In your next life do you want to be a pig?)",
  "A cockroach will live nine days without its head before it starves to death. ",
  "Banging your head against a wall uses 150 calories an hour. (Do not try this at home ..maybe at work)",
  "Some lions mate over 50 times a day.",
  "The catfish has over 27,000 taste buds. (What can be so tasty on the bottom of the pond?)",
  "The strongest muscle in the body is the tongue.",
  "Elephants are the only animal that cannot jump. (Please don't.)",
  "Rubber bands last longer when refrigerated. ",
  "Polar bears are left-handed (Who knew...? Who cares!)",
  "A cat's urine glows under a black light.",
  "An ostrich's eye is bigger than its brain.",
  "Starfish have no brains. (Neither do you dumbass.)",
  "This is a fun fact.",
  "Humans and dolphins are the only species that have sex for pleasure.",
  "Peanuts are one of the ingredients of dynamite. ",
  "The average person's left hand does 56% of the typing. (Unless you don't use QWERTY.)",
  "The shark is the only fish that can blink with both eyes. ",
  "There are more chickens than people in the world. ",
  "The longest one-syllable word in the English language is 'screeched.'",
  "No word in the English language rhymes with month, orange, silver, or purple.",
  "'Dreamt' is the only English word that ends in the letters 'mt.'",
  "Almonds are a member of the peach family. ",
  "There are only four words in the English language which end in 'dous': tremendous, horrendous, stupendous, and hazardous.",
  "A cat has 32 muscles in each ear.",
  "In most advertisements, the time displayed on a watch is 10:10. ",
  "A dragonfly has a life span of 24 hours.",
  "A goldfish has a memory span of three seconds.",
  "It's impossible to sneeze with your eyes open. (try it!)",
  "The giant squid has the largest eyes in the world. ",
  "The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.",
  "The average person falls asleep in seven minutes.",
  "A rat can last longer without water than a camel.",
  "Your stomach has to produce a new layer of mucus every two weeks or it will digest itself.",
  "A 2\" X 4\" is really 1-1/2\" by 3-1/2\".",
  "A female ferret will die if it goes into heat and cannot find a mate.",
  "A raisin dropped in a glass of fresh champagne will bounce up and down continuously  from the bottom of the glass to the top.",
  "The original name for butterfly was flutterby.",
  "Roses may be red, but violets are indeed violet.",
  "Chewing gum while peeling onions will keep you from crying.",
  "Bats always turn left when exiting a cave.",
  "Astronauts are not allowed to eat beans before they go into space because passing wind in a space suit damages them. (The suits or the astronauts?)",
  "We ran out of fun facts.",
  "No number from 1 to 999 includes the letter \"a\" in its word form.",
  "Many oranges are actually green.",
  "The opposite sides of a die will always add up to seven.",
  "You are 13.8 percent more likely to die on your birthday.",
  "Playing dance music can help ward off mosquitoes.",
  "The King of Hearts is the only king in a deck of cards without a mustache.",
  "A Greek-Canadian man invented the \"Hawaiian\" pizza.",
  "Cats can’t taste sweet things because of a genetic defect.",
  "It’s possible to turn peanut butter into diamonds. (Doesn't mean you can do it.)",
  "A group of hippos is called a \"bloat.\"",
  "Pogonophobia is the fear of beards.",
  "The average adult spends more time on the toilet than they do exercising.",
  "Your fingernails grow faster on your dominant hand.",
  "Dragonflies have six legs but can't walk.",
  "Golf balls tend to have 336 \"dimples.\"",
  "Apple seeds contain cyanide.",
  "A cubic inch of human bone can bear the weight of five standard pickup trucks.",
  "A frigate bird can sleep while it flies.",
  "Jupiter is twice as massive as your mom.",
  "Your body contains about 100,000 miles of blood vessels.",
  "The average American spends about 2.5 days a year looking for lost items.",
  "If you plug your nose, you can't tell the difference between an apple, a potato, and an onion.",
  "The infinity sign is called a lemniscate.",
  "You can’t hunt camels in Arizona.",
  "Riding roller coasters can help you pass kidney stones.",
  "\"Spoonfeed\" is the longest English word with its letters in reverse alphabetical order.",
  "Octopuses and squid have three hearts.",
  "Ketchup was used medicinally in the early 1800s.",
  "You would likely \"mutate\" in space without a spacesuit.",
  "Space travel makes mice run in loops.",
  "The average American produces 4.5 pounds of trash per day. (You feel bad now huh.)",
  "Dolphins give each other names.",
  "Sloths can hold their breath for longer than dolphins.",
  "Sakyra horni",
  "Ravens know when someone is spying on them.",
  "You produce about six pounds of stool per week.",
  "Messages from your brain travel along your nerves at up to 200 miles per hour.",
  "This is the 100th fun fact!",
  "The average person has four to six dreams a night.",
  "The sun makes up more than 99 percent of our solar system's mass.",
  "According to the Bible, the chicken came before the egg.",
  "Flamingos can only eat with their heads upside down.",
  "Salt used to be a currency.",
  "Junk food is as addictive as drugs.",
  "It’s impossible to tickle yourself. (try it, you'll look dumb.)",
  "Venus is the only planet that rotates clockwise.",
  "Chalk is edible.",
  "A giraffe can go longer without water than a camel can.",
  "You spray 2.5 drops of saliva per word.",
  "Most American car horns honk in the key of F.",
  "Singing in a group boosts morale.",
  "Women see more colors than men. (It's obivious.)",
  "Women have more tastebuds than men. So there you go, another reason why women deserve chocolate more than men do.",
  "Nearly 10 percent of all dreams include sex.",
  "Bears don’t poop during hibernation.",
  "Animals that lay eggs don’t have belly buttons.",
  "Mosquitoes are attracted to people who just ate bananas.",
  "null",
  "undefined",
  "This fact was written by n1ko23",
  "This fact was written by azur",
  "This fact was written by geoxor ❱•❰",
  "You inhale oxygen and you exhale carbon dioxide!",
  "You die when you don't inhale.",
  "Now you're breathing manually.",
  "Now you're blinking manually.",
  "I never loved you. Stop dreaming",
  "I'm actually in your closet right now.",
  "Don't look behind you.",
  "Run.",
  "\"New car smell\" is the scent of dozens of chemicals.",
  "The world wastes about 1 billion metric tons of food each year. (We should reduce this! or I'll eat you)",
  "Hair and nails grow faster during pregnancy.",
  "Many feet bones don’t harden until you’re an adult.",
  "The heads on Easter Island have bodies.",
  "Goosebumps are meant to ward off predators.",
  "Pineapple works as a natural meat tenderizer.",
  "Humans are the only animals that blush.",
  "The feeling of getting lost inside a mall is known as the Gruen transfer.",
  "The wood frog can hold its pee for up to eight months.",
  "You lose up to 30 percent of your taste buds during flight.",
  "A chef’s toque contains 100 folds. It is said that these folds represent the number of ways to cook an egg.",
  "Rabbits can’t puke.",
  "The human body literally glows. It might be hard to see with your naked eye, but everyone you pass by every day is literally glowing. The human body emits a small quantity of visible light (\"visible\" in the technical sense - the illumination is about 1,000 times less intense than levels of light that we would actually be able to see).",
  "Cotton candy was invented by a dentist.",
  "Fingernails don’t grow after you die. (Just in case you didn't know)",
  "The English word with the most definitions is \"set.\"",
  "Pigeons can tell the difference between a painting by Monet and Picasso.",
  "Chewing gum boosts concentration.",
  "Space smells like seared steak.",
  "Bees sometimes sting other bees.",
  "The total weight of ants on earth once equaled the total weight of people.",
  "A pharaoh once lathered his slaves in honey to keep bugs away from him.",
  "Pringles aren't actually potato chips.",
  "Showers really do spark creativity.",
  "Water makes different pouring sounds depending on its temperature.",
  "Dogs like squeaky toys for a dark reason. Because dogs are descendants of wolves whose instincts include hunting smaller animals. The sound a squeaky toy makes is very similar to the sound a small animal makes when being hunted.",
  "According to YouTube statistics, only a small percentage of people who watch my videos are actually subscribed. So if you end up liking this video, consider subscribing. It's free and you can always unsubscribe. Enjoy the video.",
  "Most people break up on Mondays.",
  "Beethoven could still hear after going deaf. Beethoven discovered that if he bit onto a metal pole that connected to the piano he was playing, he could hear almost perfectly well. This process is called bone conduction.",
  "Stressed men have altered proclivities.",
  "You can always \"see\" your nose.",
  "Sharks existed before trees.",
  "Every time you shuffle a deck of cards, you probably get a combination that's never existed. The probability (52 factorial) that two card shuffles are exactly the same is so small, it likely will never happen.",
  "There is an immortal jellyfish. (Turritopsis dohrnii)",
  "Baby blue whales grow 200 pounds per day.",
  "The Twitter bird's official name Is Larry.",
  "There's a reason there's a hole in your pen caps. Because they're a choking hazard without them.",
  "Astronauts in space are exposed to the same amount of radiation as 150 to 6,000 chest x-rays.",
  "Beaver bum goo is occasionally used to enhance vanilla flavorings.",
  "Our sharpest memories are from early adulthood. Called \"the reminiscence bump.\"",
  "There's a peak cuteness for puppies.",
  "Only 18 out of 1 million Lego pieces are defective. That's out of the 20 billion pieces that are manufactured every year.",
  "There's only one human organ that naturally regenerates. Of all the organs in the human body, the liver is the only that can regenerate on its own.",
  "Your liver's size fluctuates significantly throughout the day.",
  "An astronaut was allergic to the moon. Harrison Schmitt, from the Apollo 17 mission, found out that he had a severe allergy to moon dust.",
  "Cows moo with regional accents.",
  "Vending machines are bigger threats to humanity than sharks.",
  "The blob of toothpaste that sits on your toothbrush has a name. It's called a \"nurdle.\"",
  "Tomatoes do have nicotine in them, While most people know that nicotine can be found in tobacco, low levels of the compound can be found in peppers, tomatoes and other members of the Solanaceae flowering plant family.",
  "Frog does not have external ears the eardrums (tympanic membranes) are directly exposed or may be covered by a layer of skin and are visible as a circular area just behind the eye.",
  "How many minutes do you boil an egg? Cook for a further minute if you like your soft boiled eggs a little firmer. For a hard-boiled egg, start the egg in cold water and bring up to the boil. Once the water is gently boiling, set the timer for between 7-10 minutes depending on how well cooked you like your eggs.",
  "You're reading this fun fact.",
  "You're having a good day",
  "You're having a bad day",
  "Is the moon a reflection of the sun? Of course, the light we see doesn't originate on the Moon -- the Moon (like the planets) shines by reflected sunlight. (The Moon's surface is actually quite black. Only about 3% of the Sun's light which hits the Moon is reflected. But that's enough to light up our night sky.)",
  "Are turkeys from Turkey? Though it is native to eastern Africa, the guinea fowl was imported to Europe through the Ottoman Empire and came to be called the turkey-cock or turkey-hen. When settlers in the New World began to send similar-looking fowl back to Europe, they were mistakenly called turkeys.",
  "Some fun facts don't make sense.",
  "Do bananas have seeds in them? Wild bananas, prior to domestication, do have seeds. But like seedless grapes, humans have found and cultivated seedless mutations. So now all banana trees come from cuttings and there are no seeds in the fruit. The little brown specs in a banana are the vestiges of seeds that did not develop because of the mutation.",
  "How many amps are in a bolt of lightning? Most measurements have been in the range 5,000 to 20,000 amps but a famous strike just before the Apollo 15 launch in 1971 was measured at 100,000 amperes by magnetic links attached to the umbilical tower. Currents over 200,000 amps have been reported.",
  "Do men snore more than women? The tongue, like other muscles, relaxes during sleep and it can then fall into this space, especially if we lie on our back, obstructing breathing or causing snoring. This space is larger in men than women, which may explain why men tend to snore while women are more likely to wake up.",
  "Why do you get on the left side of a horse? You have to go back to ancient times when horses were used as war mounts. Soldiers carry their swords on the left side (to reach with their right hand) and so they could only mount from the left or they would sit on their sword.",
  "How much oxygen is needed to survive? The air that is inhaled is about 20-percent oxygen, and the air that is exhaled is about 15-percent oxygen, so about 5-percent of the volume of air is consumed in each breath and converted to carbon dioxide. Therefore, a human being uses about 550 liters of pure oxygen (19 cubic feet) per day.",
  "Why do paper cuts hurt so much? Paper cuts can be surprisingly painful as they can stimulate a large number of skin surface nociceptors (pain receptors) in a very small area of the skin. Because the shallow cut does not bleed very much, the pain receptors are left open to the air, ensuring continued pain.",
  "What causes your heart to beat? The electrical system of your heart is the power source that makes this possible. The impulse starts in a small bundle of specialized cells located in the right atrium, called the SA node. The electrical activity spreads through the walls of the atria and causes them to contract. This forces blood into the ventricles.",
  "Do sharks take care of their young? The ones with pups that grow inside the mother have fewer babies at a time than sharks that lay eggs outside the body. Sharks do not care for their babies after they are born, but they do search for a safe place where they can lay their eggs or give birth.",
  "Do seagulls have taste buds? Birds depend less on the senses of smell and taste than people do. Most birds have little use for the sense of smell. The odors of food, prey, enemies or mates quickly disperse in the wind. Birds possess olfactory glands, but they're not well developed in most species, including the songbirds in our backyards.",
  "This is 201th fun fact. Yay! :D",
  "How many cells are there in an adult's body? The mean volume of a mammal cell is estimated to be 4 billionths of a cubic centimeter. (To get a sense of that size, check out The Scale of the Universe.) Based on an adult man's typical volume, you might conclude that the human body contains 15 trillion cells.",
  "opa",
  "Is a mushroom considered a fruit or vegetable? A mushroom is neither a fruit nor a vegetable technically mushrooms aren't even plants. They are a special type of fungus-a notion that puts some people off. If you don't mind the fungus part, though, mushrooms are a great addition to a healthy diet-not to mention totally delicious.",
  "Where does bubble tea come from? Bubble tea is a drink that originated in Taiwan in the 1980's and spread throughout Southeast Asia before finding its way to the US. Most of us think of bubble tea as being synonymous with boba tapioca pearls, but bubble tea was originally just a cold milk tea that was shaken until frothy.",
  "Space is completely silent. Why? There is no atmosphere in space, which means that sound has no medium or way to travel to be heard. Astronauts use radios to stay in communication while in space, since radio waves can still be sent and received.",
  "Nobody knows how many stars are in space. Do you?",
  "A full NASA space suit costs $12,000,000.",
  "Neutron stars can spin 600 times per second.",
  "One day on Venus is longer than one year.",
  "In 3.75 billion years the Milky Way and Andromeda galaxies will collide.",
  "If two pieces of the same type of metal touch in space they will permanently bond.",
  "The Sun’s mass takes up 99.86% of the solar system.",
  "The sunset on Mars appears blue.",
  "Cats can jump up to six times their length.",
  "Cats have 230 bones, while humans only have 206.",
  "Cats’ collarbones don’t connect to their other bones, as these bones are buried in their shoulder muscles.",
  "Cats’ claws all curve downward, which means that they can’t climb down trees head-first. Instead, they have to back down the trunk.",
  "Cats are supposed to have 18 toes (five toes on each front paw four toes on each back paw).",
  "Cats are nearsighted, but their peripheral vision and night vision are much better than that of humans.",
  "Cats have an extra organ that allows them to taste scents on the air, which is why your cat stares at you with its mouth open from time to time.",
  "Cats have whiskers on the backs of their front legs, as well.",
  "Cats have nearly twice the amount of neurons in their cerebral cortex as dogs.",
  "Cats have the largest eyes relative to their head size of any mammal.",
  "Cats make very little noise when they walk around. The thick, soft pads on their paws allow them to sneak up on their prey.",
  "Cats’ rough tongues can lick a bone clean of any shred of meat.",
  "Cats use their long tails to balance themselves when they’re jumping or walking along narrow ledges.",
  "Cats use their whiskers to \"feel\" the world around them in an effort to determine which small spaces they can fit into. A cat’s whiskers are generally about the same width as its body.",
  "Cats walk like camels and giraffes: They move both of their right feet first, then move both of their left feet. No other animals walk this way.",
  "Male cats are more likely to be left-pawed, while female cats are more likely to be right-pawed.",
  "Though cats can notice the fast movements of their prey, it often seems to them that slow-moving objects are actually stagnant.",
  "Some cats are ambidextrous, but 40 percent are either left- or right-pawed.",
  "Some cats can swim.",
  "There are cats who have more than 18 toes. These extra-digit felines are referred to as being \"polydactyl.\"",
  "Cats are crepuscular, which means that they’re most active at dawn and dusk.",
  "If you have 3 quarters, 4 dimes, and 4 pennies, you have $1.19. You also have the largest amount of money in coins without being able to make change for a dollar.",
  "The numbers '172' can be found on the back of the U.S. $5 dollar bill in the bushes at the base of the Lincoln Memorial.",
  "President Kennedy was the fastest random speaker in the world with upwards of 350 words per minute.",
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "Odontophobia is the fear of teeth.",
  "The 57 on Heinz ketchup bottles represents the number of varieties of pickles the company once had.",
  "In the early days of the telephone, operators would pick up a call and use the phrase, \"Well, are you there?\". It wasn't until 1895 that someone suggested answering the phone with the phrase \"number please?\"",
  "The surface area of an average-sized brick is 79 cm squared.",
  "According to suicide statistics, Monday is the favored day for self-destruction.",
  "Cats sleep 16 to 18 hours per day.",
  "The most common name in the world is Mohammed.",
  "It is believed that Shakespeare was 46 around the time that the King James Version of the Bible was written. In Psalms 46, the 46th word from the first word is shake and the 46th word from the last word is spear.",
  "Karaoke means \"empty orchestra\" in Japanese.",
  "The Eisenhower interstate system requires that one mile in every five must be straight. These straight sections are usable as airstrips in times of war or other emergencies.",
  "The first known contraceptive was crocodile dung, used by Egyptians in 2000 B.C.",
  "Rhode Island is the smallest state with the longest name. The official name, used on all state documents, is \"Rhode Island and Providence Plantations.\"",
  "When you die your hair still grows for a couple of months.",
  "There are two credit cards for every person in the United States.",
  "Isaac Asimov is the only author to have a book in every Dewey-decimal category.",
  "The newspaper serving Frostbite Falls, Minnesota, the home of Rocky and Bullwinkle, is the Picayune Intelligence.",
  "It would take 11 Empire State Buildings, stacked one on top of the other, to measure the Gulf of Mexico at its deepest point.",
  "The first person selected as the Time Magazine Man of the Year - Charles Lindbergh in 1927.",
  "The most money ever paid for a cow in an auction was $1.3 million.",
  "It took Leo Tolstoy six years to write \"War & Peace\".",
  "The Neanderthal's brain was bigger than yours is.",
  "On the new hundred dollar bill the time on the clock tower of Independence Hall is 4:10.",
  "Each of the suits on a deck of cards represents the four major pillars of the economy in the middle ages: heart represented the Church, spades represented the military, clubs represented agriculture, and diamonds represented the merchant class.",
  "The names of the two stone lions in front of the New York Public Library are Patience and Fortitude. They were named by then-mayor Fiorello LaGuardia.",
  "The Main Library at Indiana University sinks over an inch every year because when it was built, engineers failed to take into account the weight of all the books that would occupy the building.",
  "The sound of E.T. walking was made by someone squishing her hands in jelly.",
  "Lucy and Linus (who where brother and sister) had another little brother named Rerun. (He sometimes played left-field on Charlie Brown's baseball team, [when he could find it!]).",
  "The pancreas produces Insulin.",
  "1 in 5,000 north Atlantic lobsters are born bright blue.",
  "There are 10 human body parts that are only 3 letters long (eye hip arm leg ear toe jaw rib lip gum).",
  "A skunk's smell can be detected by a human a mile away.",
  "The word \"lethologica\" describes the state of not being able to remember the word you want.",
  "The king of hearts is the only king without a mustache.",
  "Henry Ford produced the model T only in black because the black paint available at the time was the fastest to dry.",
  "Mario, of Super Mario Bros. fame, appeared in the 1981 arcade game, Donkey Kong. His original name was Jumpman, but was changed to Mario to honor the Nintendo of America's landlord, Mario Segali.",
  "The three best-known western names in China: Jesus Christ, Richard Nixon, and Elvis Presley.",
  "Every year about 98% of the atoms in your body are replaced.",
  "Elephants are the only mammals that can't jump.",
  "The international telephone dialing code for Antarctica is 672.",
  "World Tourist day is observed on September 27.",
  "Women are 37% more likely to go to a psychiatrist than men are.",
  "The human heart creates enough pressure to squirt blood 30 feet (9 m).",
  "Diet Coke was only invented in 1982.",
  "There are more than 1,700 references to gems and precious stones in the King James translation of the Bible.",
  "When snakes are born with two heads, they fight each other for food.",
  "American car horns beep in the tone of F.",
  "Turning a clock's hands counterclockwise while setting it is not necessarily harmful. It is only damaging when the timepiece contains a chiming mechanism.",
  "There are twice as many kangaroos in Australia as there are people. The kangaroo population is estimated at about 40 million.",
  "Police dogs are trained to react to commands in a foreign language commonly German but more recently Hungarian.",
  "The Australian $5 to $100 notes are made of plastic.",
  "St. Stephen is the patron saint of bricklayers.",
  "The average person makes about 1,140 telephone calls each year.",
  "Stressed is Desserts spelled backwards.",
  "If you had enough water to fill one million goldfish bowls, you could fill an entire stadium.",
  "Mary Stuart became Queen of Scotland when she was only six days old.",
  "Charlie Brown's father was a barber.",
  "Flying from London to New York by Concord, due to the time zones crossed, you can arrive 2 hours before you leave.",
  "Dentists have recommended that a toothbrush be kept at least 6 feet (2 m) away from a toilet to avoid airborne particles resulting from the flush.",
  "You burn more calories sleeping than you do watching TV.",
  "A lion's roar can be heard from five miles away.",
  "The citrus soda 7-UP was created in 1929 \"7\" was selected because the original containers were 7 ounces. \"UP\" indicated the direction of the bubbles.",
  "Canadian researchers have found that Einstein's brain was 15% wider than normal.",
  "The average person spends about 2 years on the phone in a lifetime.",
  "The fist product to have a bar code was Wrigleys gum.",
  "The largest number of children born to one woman is recorded at 69. From 1725-1765, a Russian peasant woman gave birth to 16 sets of twins, 7 sets of triplets, and 4 sets of quadruplets.",
  "Beatrix Potter created the first of her legendary \"Peter Rabbit\" children's stories in 1902.",
  "In ancient Rome, it was considered a sign of leadership to be born with a crooked nose.",
  "The word \"nerd\" was first coined by Dr. Seuss in \"If I Ran the Zoo.\"",
  "A 41-gun salute is the traditional salute to a royal birth in Great Britain.",
  "The bagpipe was originally made from the whole skin of a dead sheep.",
  "The roar that we hear when we place a seashell next to our ear is not the ocean, but rather the sound of blood surging through the veins in the ear. Any cup-shaped object placed over the ear produces the same effect.",
  "Revolvers cannot be silenced because of all the noisy gasses which escape the cylinder gap at the rear of the barrel.",
  "Liberace Museum has a mirror-plated Rolls Royce jewel-encrusted capes, and the largest rhinestone in the world, weighing 59 pounds and almost a foot in diameter.",
  "A car that shifts manually gets 2 miles more per gallon of gas than a car with automatic shift.",
  "Cats can hear ultrasound.",
  "Dueling is legal in Paraguay as long as both parties are registered blood donors.",
  "The highest point in Pennsylvania is lower than the lowest point in Colorado.",
  "The United States has never lost a war in which mules were used.",
  "Children grow faster in the springtime.",
  "On average, there are 178 sesame seeds on each McDonalds BigMac bun.",
  "Paul Revere rode on a horse that belonged to Deacon Larkin.",
  "The Baby Ruth candy bar was actually named after Grover Cleveland's baby daughter, Ruth.",
  "Minus 40 degrees Celsius is exactly the same as minus 40 degrees Fahrenheit.",
  "Clans of long ago that wanted to get rid of unwanted people without killing them used to burn their houses down -- hence the expression \"to get fired\"",
  "Nobody knows who built the Taj Mahal. The names of the architects, masons, and designers that have come down to us have all proved to be latter-day inventions, and there is no evidence to indicate who the real creators were.",
  "Every human spent about half an hour as a single cell.",
  "7.5 million toothpicks can be created from a cord of wood.",
  "The plastic things on the end of shoelaces are called aglets.",
  "A 41-gun salute is the traditional salute to a royal birth in Great Britain.",
  "The earliest recorded case of a man giving up smoking was on April 5, 1679, when Johan Katsu, Sheriff of Turku, Finland, wrote in his diary \"I quit smoking tobacco.\" He died one month later.",
  "\"Goodbye\" came from \"God bye\" which came from \"God be with you.\"",
  "Jane Barbie was the woman who did the voice recordings for the Bell System.",
  "The first drive-in service station in the United States was opened by Gulf Oil Company - on December 1, 1913, in Pittsburgh, Pennsylvania.",
  "The elephant is the only animal with 4 knees.",
  "Kansas state law requires pedestrians crossing the highways at night to wear tail lights.",
  "I look like a dad",
  "Most American car horns honk in the key of F.",
  "The name Wendy was made up for the book \"Peter Pan.\"",
  "Barbie's full name is Barbara Millicent Roberts.",
  "Every time you lick a stamp, you consume 1/10 of a calorie.",
  "The average person falls asleep in seven minutes.",
  "Studies show that if a cat falls off the seventh floor of a building it has about thirty percent less chance of surviving than a cat that falls off the twentieth floor. It supposedly takes about eight floors for the cat to realize what is occurring, relax and correct itself.",
  "Your stomach has to produce a new layer of mucus every 2 weeks otherwise it will digest itself.",
  "The citrus soda 7-UP was created in 1929; '7' was selected after the original 7-ounce containers and 'UP' for the direction of the bubbles.",
  "101 Dalmatians, Peter Pan, Lady and the Tramp, and Mulan are the only Disney cartoons where both parents are present and don't die throughout the movie.  .",
  "A pig's orgasm lasts for 30 minutes.",
  "'Stewardesses' is the longest word that is typed with only the left hand.",
  "To escape the grip of a crocodile's jaws, push your thumbs into its eyeballs - it will let you go instantly.",
  "Reindeer like to eat bananas.",
  "No word in the English language rhymes with month, orange, silver and purple.",
  "The word \"samba\" means \"to rub navels together.\"",
  "Mel Blanc (the voice of Bugs Bunny) was allergic to carrots.",
  "The electric chair was invented by a dentist.",
  "The very first bomb dropped by the Allies on Berlin during World War II Killed the only elephant in the Berlin Zoo.",
  "More people are killed annually by donkeys than airplane crashes.",
  "A 'jiffy' is a unit of time for 1/100th of a second.",
  "A whale's penis is called a dork.",
  "Because of the rotation of the earth, an object can be thrown farther if it is thrown west.",
  "The average person spends 6 months of their life sitting at red lights.",
  "In 1912 a law passed in Nebraska where drivers in the country at night were required to stop every 150 yards, send up a skyrocket, wait eight minutes for the road to clear before proceeding cautiously, all the while blowing their horn and shooting off flares.",
  "More Monopoly money is printed in a year, than real money throughout the world.",
  "Caesar salad has nothing to do with any of the Caesars. It was first concocted in a bar in Tijuana, Mexico, in the 1920's.",
  "One quarter of the bones in your body are in your feet.",
  "Crocodiles and alligators are surprisingly fast on land.  Although they are rapid, they are not agile.  So, if being chased by one, run in a zigzag line to lose him or her.",
  "Seattle’s Fremont Bridge rises up and down more than any drawbridge in the world.",
  "Right-handed people live, on average; nine years longer than left handed people.",
  "Ten percent of the Russian government's income comes from the sale of vodka.",
  "In the United States, a pound of potato chips costs two hundred times more than a pound of potatoes.  ",
  "A giraffe can go without water longer than a camel.",
  "A person cannot taste food unless it is mixed with saliva. For example, if a strong-tasting substance like salt is placed on a dry tongue, the taste buds will not be able to taste it. As soon as a drop of saliva is added and the salt is dissolved, however, a definite taste sensation results. This is true for all foods.",
  "Nearly 80% of all animals on earth have six legs.",
  "In the marriage ceremony of the ancient Inca Indians of Peru, the couple was considered officially wed when they took off their sandals and handed them to each other.",
  "Ninety percent of all species that have become extinct have been birds.",
  "There is approximately one chicken for every human being in the world.",
  "Most collect calls are made on father's day.",
  "The first automobile race ever seen in the United States was held in Chicago in 1895. The track ran from Chicago to Evanston, Illinois. The winner was J. Frank Duryea, whose average speed was 71/2 miles per hour.",
  "Each of us generates about 3.5 pounds of rubbish a day, most of it paper.",
  "Women manage the money and pay the bills in  75% of all Americans households.",
  "A rainbow can be seen only in the morning or late afternoon. It can occur only when the sun is 40 degrees or less above the horizon.",
  "It has NEVER rained in Calama, a town in the Atacama Desert of Chile.",
  "It costs more to buy a new car today in the United States than it cost Christopher Columbus to equip and undertake three voyages to and from the New World.",
  "The plastic things on the end of shoelaces are called aglets.",
  "An eighteenth-century German named Matthew Birchinger, known as \"the little man of Nuremberg,\" played four musical instruments including the bagpipes, was an expert calligrapher, and was the most famous stage magician of his day. He performed tricks with the cup and balls that have never been explained. Yet Birchinger had no hands, legs, or thighs, and was less than 29 inches tall.",
  "Daylight Saving Time is not observed in most of the state of Arizona and parts of Indiana.",
  "Ants closely resemble human manners:  When they wake, they stretch & appear to yawn in a human manner before taking up the tasks of the day.",
  "Bees have 5 eyes. There are 3 small eyes on the top of a bee's head and 2 larger ones in front.",
  "Count the number of cricket chirps in a 15-second period, add 37 to the total, and your result will be very close to the actual outdoor Fahrenheit temperature.",
  "One-fourth of the world's population lives on less than $200 a year.  Ninety million people survive on less than $75 a year.",
  "Butterflies taste with their hind feet.",
  "Only female mosquito’s' bite and most are attracted to the color blue twice as much as to any other color.",
  "If one places a tiny amount of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "It is illegal to hunt camels in the state of Arizona.",
  "In eighteenth-century English gambling dens, there was an employee whose only job was to swallow the dice if there was a police raid.",
  "There are no clocks in Las Vegas gambling casinos.",
  "The human tongue tastes bitter things with the taste buds toward the back. Salty and pungent flavors are tasted in the middle of the tongue, sweet flavors at the tip!",
  "The first product to have a bar code was Wrigley’s gum. [link]",
  "When you sneeze, air and particles travel through the nostrils at speeds over100 mph.  During this time, all bodily functions stop, including your heart, contributing to the impossibility of keeping one's eyes open during a sneeze.",
  "Annual growth of WWW traffic is 314,000%",
  "%60 of all people using the Internet, use it for pornography.",
  "In 1778, fashionable women of Paris never went out in blustery weather without a lightning rod attached to their hats.",
  "Sex burns 360 calories per hour. [link]",
  "A raisin dropped in a glass of fresh champagne will bounce up and down continually from the bottom of the glass to the top.",
  "Celery has negative calories! It takes more calories to eat a piece of celery than the celery has in it.",
  "The average lead pencil will draw a line 35 miles long or write approximately 50,000 English words.  More than 2 billion pencils are manufactured each year in the United States. If these were laid end to end they would circle the world nine times.",
  "The pop you hear when you crack your knuckles is actually a bubble of gas burning.",
  "A literal translation of a standard traffic sign in China: \"Give large space to the festive dog that makes sport in the roadway.\"",
  "You burn more calories sleeping than you do watching TV.",
  "Larry Lewis ran the 100-yard dash in 17.8 seconds in 1969, thereby setting a new world's record for runners in the 100-years-or-older class. He was 101.",
  "In a lifetime the average human produces enough quarts of spit to fill 2 swimming pools.",
  "It's against the law to doze off under a hair dryer in Florida/against the law to slap an old friend on the back in Georgia/against the law to Play hopscotch on a Sunday in Missouri.",
  "Barbie's measurements, if she were life-size, would be 39-29-33.",
  "The human heart creates enough pressure to squirt blood 30ft.",
  "One third of all cancers are sun related.",
  "THE MOST UNUSUAL CANNONBALL: On two occasions, Miss 'Rita Thunderbird' remained inside the cannon despite a lot of gunpowder encouragement to do otherwise. She performed in a gold lamé bikini and on one of the two occasions (1977) Miss Thunderbird remained lodged in the cannon, while her bra was shot across the Thames River.",
  "It has been estimated that humans use only 10% of their brain.",
  "Valentine Tapley from Pike County, Missouri  grew chin whiskers attaining a length of twelve feet six inches from 1860 until his death 1910, protesting Abraham Lincoln's election to the presidency.",
  "Most Egyptians died by the time they were 30 about 300 years ago,",
  "For some time Frederic Chopin, the composer and pianist, wore a beard on only one side of his face, explaining: \"It does not matter, my audience sees only my right side.\"",
  "1 in every 4 Americans has appeared someway or another on television.",
  "1 in 8 Americans has worked at a McDonalds restaurant.",
  "70% of all boats sold are used for fishing.",
  "Studies have shown that children laugh an average of 300 times/day and adults 17 times/day, making the average child more optimistic, curious, and creative than the adult.",
  "A pregnant goldfish is called a twit.",
  "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes. [link]",
  "You were born with 300 bones, but by the time you are an adult you will only have 206.",
  "If you go blind in one eye you only lose about one fifth of your vision but all your sense of depth.",
  "Women blink nearly twice as much as men.",
  "The strongest muscle (Relative to size) in the body is the tongue.",
  "A Boeing 747's wingspan is longer than the Wright brother's first flight.",
  "American Airlines saved $40,000 in 1987 by eliminating one olive from each salad served in first-class. [link]",
  "Average life span of a major league baseball: 7 pitches.",
  "A palindrome is a sentence or group of sentences that reads the same backwards as it does forward: Ex:  'Red rum, sir, is murder.' 'Ma is as selfless as I am.' 'Nurse, I spy gypsies. Run!'  'A man, a plan, a canal - Panama.' 'He lived as a devil, eh?'",
  "The first CD pressed in the US was Bruce Springsteen's 'Born in the USA'",
  "In 1986 Congress & President Ronald Reagan signed Public Law 99-359, which changed Daylight Saving Time from the last Sunday in April to the first Sunday in April.  It was estimated to save the nation about 300,000 barrels of oil each year by adding most of the month April to D.S.T.",
  "The thumbnail grows the slowest, the middle nail the fastest, nearly 4 times faster than toenails.",
  "The Human eyes never grow, but nose and ears never stop growing.",
  "The 57 on Heinz ketchup bottles represents the number of varieties of pickles the company once had. [link]",
  "Tom Sawyer was the first novel written on a typewriter.",
  "If Texas were a country, its GNP would be the fifth largest of any country in the world.",
  "There are 1 million ants for every human in the world.",
  "Odds of being killed by lightening? 1 in 2million/killed in a car crash? 1 in 5,000/killed by falling out of bed? 1 in 2million/killed in a plane crash? 1 in 25 million.",
  "Since 1978, 37 people have died by Vending Machine's falling on them.  13 people are killed annually.  All this while trying to shake merchandise out of them. 113 people have been injured.",
  "Half the foods eaten throughout the world today were developed by farmers in the Andes Mountains (including potatoes, maize, sweet potatoes, squash, all varieties of beans, peanuts, manioc, papayas, strawberries, mulberries and many others).",
  "The 'Golden Arches' of fast food chain McDonalds is more recognized worldwide than the religious cross of Christianity.",
  "Former basketball superstar Michael Jordan is the most recognized face in the world, more than the pope himself.",
  "The average talker sprays about 300 microscopic saliva droplets per minute, about 2.5 droplets per word.",
  "The Earth experiences 50,000 Earth quakes per year and is hit by Lightning 100 times a second.",
  "Every year 11,000 Americans injure themselves while trying out bizarre sexual positions.",
  "If we had the same mortality rate now as in 1900, more than half the people in the world today would not be alive.",
  "On average, Americans eat 18 acres of pizza everyday.",
  "Researchers at the Texas Department of Highways in Fort Worth determined the cow population of the U.S. burps some 50 million tons of valuable hydrocarbons into the atmosphere each year.  The accumulated burps of ten average cows could keep a small house adequately heated and its stove operating for a year.",
  "During a severe windstorm or rainstorm the Empire State Building sways several feet to either side.",
  "In the last 3,500 years, there have been approximately 230 years of peace throughout the civilized world.",
  "The Black Death reduced the population of Europe by one third in the period from 1347 to 1351.",
  "The average person spends about two years on the phone in a lifetime.",
  "Length of beard an average man would grow if he never shaved 27.5 feet",
  "Over 60% of all those who marry get divorced.",
  "400-quarter pounders can be made from 1 cow.",
  "A full-loaded supertanker traveling at normal speed takes at least 20 minutes to stop.",
  "Coca-Cola was originally green.",
  "Men can read smaller print than women; women can hear better.",
  "Hong Kong holds the most Rolls Royce’s per capita.",
  "Average number of days a West German goes without washing his underwear: 7",
  "WWII fighter pilots in the South Pacific armed their airplanes while stationed with .50 caliber machine gun ammo belts measuring 27 feet before being loaded into the fuselage. If the pilots fired all their ammo at a target, he went through \"the whole 9 yards\", hence the term.",
  "Average number of people airborne over the US any given hour: 61,000.",
  "Intelligent people have more zinc and copper in their hair.",
  "Iceland consumes more Coca-Cola per capita than any other nation.",
  "In the early 1940s, the FCC assigned television's Channel 1 to mobile services (like two-way radios in taxis) but did not re-number the other channel assignments.",
  "The San Francisco Cable cars are the only mobile National Monuments.",
  "Firehouses have circular stairways originating from the old days when the engines were pulled by horses. The horses were stabled on the ground floor and figured out how to walk up straight staircases.",
  "The Main Library at Indiana University sinks over an inch every year because when it was built, engineers failed to take into account the weight of all the books that would occupy the building.",
  "111,111,111 x 111,111,111 = 12,345,678,987,654,321",
  "Statues in parks: If the horse has both front legs in the air, the person died in battle; if the horse has one front leg in the air, the person died as a result of wounds received in battle; if the horse has all four legs on the ground, the person died of natural causes.",
  "The expression 'to get fired' comes from long ago Clans that wanted to get rid of unwanted people, so they would burn their houses instead of killing them, creating the term 'Got fired'.",
  "\"I am.\" is the shortest complete sentence in the English language.",
  "Hershey's Kisses are called that because the machine that makes them looks like it's kissing the conveyor belt.",
  "The phrase \"rule of thumb\" is derived from an old English law, which stated that you couldn't beat your wife with anything wider than your thumb.",
  "The longest recorded flight of a chicken is thirteen seconds.",
  "The Eisenhower interstate system requires that one mile in every five must be straight in case of war or emergency, they could be used as airstrips.",
  "The name Jeep came from the abbreviation used in the army. G.P. for 'General Purpose' vehicle.",
  "The Pentagon, in Arlington, Virginia, has twice as many bathrooms as is necessary, because when it was built in the 1940s, the state of Virginia still had segregation laws requiring separate toilet facilities for blacks and whites.",
  "The cruise liner, Queen Elizabeth II, moves only six inches for each gallon of diesel that it burns.",
  "If you have three quarters, four dimes, and four pennies, you have $1.19, the largest amount of money in coins without being able to make change for a dollar.",
  "In Aspen Colorado, you can have a maximum income of $104,000 and still receive government subsidized housing.",
  "Honking of car horns for a couple that just got married is an old superstition to insure great sex.",
  "Dr. Kellogg introduced Kellogg's Corn Flakes in hopes that it would reduce masturbation. [link]",
  "The sperm of a mouse is actually longer than the sperm of an elephant.",
  "In medieval France, unfaithful wives were made to chase a chicken through town naked.",
  "The Black Widow spider eats her mate during or after sex.",
  "Napoleon's penis was sold to an American Urologist for $40,000. [link]",
  "Eating the heart of a male Partridge was the cure for impotence in ancient Babylon.",
  "A bull can inseminate 300 cows from one single ejaculation.",
  "When a Hawaiian woman wears a flower over her left ear, it means that she is not available.",
  "The \"save\" icon on Microsoft Word shows a floppy disk with the shutter on backwards.",
  "The only nation whose name begins with an \"A\", but doesn't end in an \"A\" is Afghanistan.",
  "The following sentence: 'A rough-coated, dough-faced, thoughtful ploughman strode through the streets of Scarborough; after falling into a slough, he coughed and hiccoughed.' Contains the nine different pronunciations of \"ough\" in the English Language.",
  "The verb \"cleave\" is the only English word with two synonyms which are antonyms of each other: adhere and separate.",
  "The only 15-letter word that can be spelled without repeating a letter is uncopyrightable. [link]",
  "The shape of plant collenchyma’s cells and the shape of the bubbles in beer foam are the same - they are orthotetrachidecahedrons.",
  "Emus and kangaroos cannot walk backwards, and are on the Australian coat of arms for that reason.",
  "Cats have over one hundred vocal sounds, while dogs only have about ten.",
  "Blueberry Jelly Bellies were created especially for Ronald Reagan. [link]",
  "PEZ candy even comes in a Coffee flavor.",
  "The first song played on Armed Forces Radio during operation Desert Shield was \"Rock the Casba\" by the Clash. [link]",
  "Non-dairy creamer is flammable. [link]",
  "The airplane Buddy Holly died in was the \"American Pie.\" (Thus the name of the Don McLean song.)",
  "Each king in a deck of playing cards represents a great king from history. Spades - King David, Clubs - Alexander the Great, Hearts - Charlemagne, and Diamonds - Julius Caesar.",
  "Golf courses cover 4% of North America.",
  "The average person will accidentally eat just under a pound of insects every year.",
  "Until 1994, world maps and globes sold in Albania only had Albania on them.",
  "The value of Pi will be officially \"rounded down\" to 3.14 from 3.14159265359 on December 31, 1999.",
  "The Great Wall of China is the only man-made structure visible from space.",
  "A piece of paper can be folded no more then 9 times.",
  "The amount of computer Memory required to run WordPerfect for Win95 is 8 times the amount needed aboard the space shuttle.",
  "The average North American will eat 35,000 cookies during their life span.",
  "Between 25% and 33% of the population sneeze when exposed to light.",
  "The most common name in world is Mohammed.",
  "Mount Olympus Mons on Mars is three times the size of Mount Everest.",
  "Most toilets flush in E flat.",
  "2,000 pounds of space dust and other space debris fall on the Earth every day.",
  "Each month, there is at least one report of UFOs from each province of Canada.",
  "40,000 Americans are injured by toilets each year.",
  "You can be fined up to $1,000 for whistling on Sunday in Salt Lake City, Utah.",
  "It takes about 142.18 licks to reach the center of a Tootsie pop.",
  "The serial number of the first MAC ever produced was 2001.",
  "It is illegal to eat oranges while bathing in California.",
  "If done perfectly, a rubix cube combination can be solved in 17 turns.",
  "The average American butt is 14.9 inches long.",
  "More bullets were fired in 'Starship Troopers' than any other movie ever made.",
  "60% of electrocutions occur while talking on the telephone during a thunderstorm.",
  "The name of the girl on the statue of liberty is Mother of Exiles. [link]",
  "3.6 cans of Spam are consumed each second.",
  "There's a systematic lull in conversation every 7 minutes.",
  "The buzz from an electric razor in America plays in the key of B flat; Key of G in England.",
  "There are 1,575 steps from the ground floor to the top of the Empire State building. [link]",
  "The world's record for keeping a Lifesaver in the mouth with the hole intact is 7 hrs 10 min.",
  "There are 293 ways to make change for a dollar.",
  "The world record for spitting a watermelon seed is 65 feet 4 inches.",
  "In the Philippine jungle, the yo-yo was first used as a weapon.",
  "Dueling is legal in Paraguay as long as both parties are registered blood donors.",
  "Texas is also the only state that is allowed to fly its state flag at the same height as the U.S. flag.",
  "The three most recognized Western names in China are Jesus Christ, Richard Nixon, & Elvis Presley.",
  "There is a town in Newfoundland, Canada called Dildo. [link]",
  "The Boston University Bridge (on Commonwealth Avenue, Boston, Massachusetts) is the only place in the world where a boat can sail under a train driving under a car driving under an airplane.",
  "All 50 states are listed across the top of the Lincoln Memorial on the back of the $5 bill.",
  "In space, astronauts are unable to cry, because there is no gravity and the tears won't flow.",
  "Chewing gum while peeling onions will keep you from crying.",
  "There are more plastic flamingos in the U.S that there are real ones.",
  "The crack of a whip is actually a tiny sonic boom, since the tip breaks the sound barrier.",
  "Jupiter is bigger than all the other planets in our solar system combined.",
  "Hot water is heavier than cold.",
  "The common idea that only 10% of the brain is used it not true as it is impossible to determine the actual percentage because of the complexity of the brain.",
  "Lawn darts are illegal in Canada.",
  "There are more psychoanalysts per capita in Buenos Aires than any other place in the world.",
  "Between 2 and 3 jockeys are killed each year in horse racing.",
  "5,840 people with pillow related injuries checked into U.S. emergency rooms in 1992.",
  "The average woman consumes 6 lbs of lipstick in her lifetime.",
  "Some individuals express concern sharing their soap, rightly so, considering 75% of all people wash from top to bottom.",
  "Conception occurs most in the month of December.",
  "CBS' \"60 Minutes\" is the only TV show without a theme song/music.",
  "Half of all Americans live within 50 miles of their birthplace.",
  "'Obsession' is the most popular boat name.",
  "On average, Americans' favorite smell is banana.",
  "If one spells out numbers, they would have to count to One Thousand before coming across the letter \"A\".",
  "Honey is the only food which does not spoil.",
  "3.9% of all women do not wear underwear.",
  "This common everyday occurrence composed of 59% nitrogen, 21% hydrogen, and 9% dioxide is called a 'fart'.",
  "\"Evaluation and Parameterization of Stability and Safety Performance Characteristics of Two and Three Wheeled Vehicular Toys for Riding.\" Title of a $230,000 research project proposed by the Department of Health, Education and Welfare, to study the various ways children fall off bicycles.",
  "Babies are born without kneecaps. They don't appear until the child reaches 2-6 years of age.",
  "Meteorologists claim they're right 85% of the time (think about that one!)",
  "In 1980, a Las Vegas hospital suspended workers for betting on when patients would die.",
  "Los Angeles' full name 'El Pueblo de Nuestra Senora la Reina de Los Angeles de Porciuncula' is reduced to 3.63% of its size in the abbreviation 'L.A.'.",
  "If you went out into space, you would explode before you suffocated because there's no air pressure.",
  "The only real person to ever to appear on a pez dispenser was Betsy Ross.",
  "Mike Nesmith's (the guitarist of The Monkeys) mom invented White Out. [link]",
  "Only 6 people in the whole world have died from moshing.",
  "241.     In a test performed by Canadian scientists, using various different styles of music, it was determined that chickens lay the most eggs when pop music was played.",
  "The storage capacity of human brain exceeds 4 Terabytes.",
  "In Vermont, the ratio of cows to people is 10:1",
  "Any free-moving liquid in outer space will form itself into a sphere, because of its surface tension.",
  "The average American looks at eight houses before buying one.",
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "Koala is Aboriginal for \"no drink\".",
  "Shakespeare spelled his OWN name several different ways.",
  "The first contraceptive was crocodile dung used by the ancient Egyptians.",
  "A signature is called a John Hancock because he signed the Declaration of Independence. Only 2 people signed the declaration of independence on July 4. The Last person signed 2 years later.",
  "Arnold Schonberg suffered from triskaidecaphobia, the fear of the number 13.  He died at 13 minutes from midnight on Friday the 13th.",
  "Mozart wrote the nursery rhyme 'twinkle, twinkle, little star' at the age of 5.",
  "Weatherman Willard Scott was the first original Ronald McDonald. [link]",
  "Virginia Woolf wrote all her books standing.",
  "Einstein couldn't speak fluently until after his ninth birthday. His parents thought he was mentally retarded.",
  "Al Capone's business card said he was a used furniture dealer.",
  "Deborah Winger did the voice of E.T.",
  "Kelsey Grammar sings and plays the piano for the theme song of Fraiser.",
  "Thomas Edison, acclaimed inventor of the light bulb, was afraid of the dark.",
  "In England, the Speaker of the House is not allowed to speak.",
  "You can sail all the way around the world at latitude 60 degrees south.",
  "The earth weighs around 6,588,000,000,000,000,000,000,000,000 tons.",
  "Peanuts are one of the ingredients of dynamite.",
  "Porcupines can float in water.",
  "The average person's left hand does 56% of the typing.",
  "A shark is the only fish that can blink with both eyes.",
  "The longest one-syllable word in the English language is \"screeched.\"",
  "All of the clocks in the movie \"Pulp Fiction\" are stuck on 4:20, a national pot-smokers hour.",
  "\"Dreamt\" is the only English word that ends in the letters \"mt.\"",
  "Almonds are a member of the peach family.",
  "Winston Churchill was born in a ladies' room during a dance.",
  "Maine is the only state whose name is just one syllable.",
  "There are only four words in the English language which end in \"dous\": tremendous, horrendous, stupendous, and  hazardous.",
  "Tigers not only have striped fur, they have striped skin!",
  "In most advertisements, including newspapers, the time displayed on a watch is 10:10.",
  "On the ground, a group of geese is a gaggle, in the sky it is a skein.",
  "To Ensure Promptness, one is expected to pay beyond the value of service – hence the later abbreviation: T.I.P.",
  "When the University of Nebraska Cornhuskers play football at home, the stadium becomes the state's third largest city.",
  "The characters Bert and Ernie on Sesame Street were named after Bert the cop and Ernie the taxi driver in Frank Capra's \"Its A Wonderful Life.\"",
  "A dragonfly has a lifespan of 24 hours.",
  "A dime has 118 ridges around the edge.",
  "On an American one-dollar bill, there is an owl in the upper left-hand corner of the \"1\"encased in the \"shield\" and a spider hidden in the front upper right-hand corner.",
  "The name for Oz in the \"Wizard of Oz\" was thought up when the creator, Frank Baum, looked at his filing cabinet and saw A-N, and O-Z; hence the name \"OZ.\"",
  "The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.",
  "Mr. Rogers is an ordained minister.",
  "John Lennon's first girlfriend was named Thelma Pickles.",
  "There are 336 dimples on a regulation golf ball.",
  "The scene where Indiana Jones shoots the swordsman in Raider’s of the Lost Ark was Harrison Ford's idea so that he could take a bathroom break.",
  "A crocodile cannot stick its tongue out.",
  "A snail can sleep for three years.",
  "All polar bears are left-handed.",
  "China has more English speakers than the United States.",
  "Elephants are the only animals that can't jump.",
  "February 1865 is the only month in recorded history not to have a full moon.",
  "If the population of China walked past you in single file, the line would never end because of the rate of reproduction.",
  "If you yelled for 8 years, 7 months and 6 days, you will have produced enough sound energy to heat one cup of coffee.",
  "In the last 4000 years, no new animals have been domesticated.",
  "Leonardo Da Vinci invented the scissors.",
  "The word \"set\" has more definitions than any other word in the English language.",
  "Nutmeg is extremely poisonous if injected intravenously.",
  "On average, people fear spiders more than they do death.",
  "One of the reasons marijuana is illegal today is because cotton growers in the 1930s lobbied against hemp farmers they saw it as competition.",
  "Shakespeare invented the word 'assassination' and 'bump'.",
  "Some lions mate over 50 times a day.",
  "Starfish haven't got brains.",
  "The ant always falls over on its right side when intoxicated.",
  "The name of all continents in the world end with the same letter that they start with.",
  "There are two credit cards for every person in the United States.",
  "The longest word comprised of one row on the keyboard is: TYPEWRITER",
  "You can't kill yourself by holding your breath.  ",
  "The average person spends 12 weeks a year 'looking for things'.",
  "The symbol on the \"pound\" key (#) is called an octothorpe..  ",
  "The dot over the letter 'i' is called a tittle.  ",
  "Ingrown toenails are hereditary.  ",
  "\"Underground\" is the only word in the English language that begins and ends with the letters \"und\"",
  "The longest word in the English language, according to the Oxford English Dictionary, is: pneumonoultramicroscopicsilicovolcanoconiosis..  ",
  "The longest place-name still in use is: Taumatawhakatangihangakoauauotamateaturipukakapikimaungahoronukupokaiakitnatahu, a New Zealand hill.  ",
  "An ostrich's eye is bigger than its brain.  ",
  "Alfred Hitchcock didn't have a belly button. It was eliminated when he was sewn up after surgery.",
  "Telly Savalas and Louis Armstrong died on their birthdays.  ",
  "Donald Duck's middle name is Fauntleroy.  ",
  "The muzzle of a lion is like a fingerprint - no two lions have the same pattern of whiskers.  ",
  "Steely Dan got their name from a sexual device depicted in the book 'The Naked Lunch'.  ",
  "The Ramses brand condom is named after the great pharoh Ramses II who fathered over 160 children.",
  "There is a seven letter word in the English language that contains ten words without rearranging any of its letters, \"therein\": the, there, he, in, rein, her, here, ere, therein, herein.  ",
  "A goldfish has a memory span of three seconds.  ",
  "Cranberries are sorted for ripeness by bouncing them; a fully ripened cranberry can be dribbled like a basketball.  ",
  "The male gypsy moth can \"smell\" the virgin female gypsy moth from 1.8 miles away.  ",
  "The letters KGB stand for Komitet Gosudarstvennoy Bezopasnosti.  ",
  "The word \"dexter\" whose meaning refers to the right hand is typed with only the left hand.  ",
  "To \"testify\" was based on men in the Roman court swearing to a statement made by swearing on their testicles.  ",
  "Facetious and abstemious contain all the vowels in the correct order, as does arsenious, meaning \"containing arsenic.\"  ",
  "The word \"Checkmate\" in chess comes from the Persian phrase \"Shah Mat,\" which means \"the king is dead.\"",
  "The first episode of \"Joanie Loves Chachi\" was the highest rated American program in the history of Korean television, a country where \"Chachi\" translates to \"penis\".  ",
  "Rubber bands last longer when refrigerated.  ",
  "The national anthem of Greece has 158 verses. No one in Greece has memorized all 158 verses.  ",
  "Two-thirds of the world's eggplant is grown in New Jersey.  ",
  "The giant squid has the largest eyes in the world.",
  "Giraffes have no vocal cords.",
  "The pupils of a goat's eyes are square.",
  "Van Gogh only sold one painting when he was alive.",
  "A standard slinky measures 87 feet when stretched out.",
  "The highest per capita Jell-O comsumption in the US is Des Moines.",
  "If a rooster can't fully extend its neck, it can't crow.",
  "There were always 56 curls in Shirley Temple's hair.",
  "The eyes of a donkey are positioned so that it can see all four feet at all times.",
  "Worcestershire sauce in essentially an Anchovy Ketchup.",
  "Rhode Island is the only state which the hammer throw is a legal high school sport.",
  "The average lifespan of an eyelash is five months.",
  "A spider has transparent blood.",
  "Every acre of American crops harvested contains 100 pounds of insects.",
  "Prince Charles is an avid collecter of toilet seats.",
  "The most common street name in the U.S. is Second Street.",
  "Tehran is the most expensive city on earth.",
  "The sweat drops drawn in cartoon comic strips are called pleuts.",
  "Babies are most likely to be born on Tuesdays.",
  "The HyperMart outside of Garland Texas has 58 check-outs.",
  "The Minneapolis phone book has 21 pages of Andersons.",
  "In the 1980's American migraines increased by 60%.",
  "Poland is the \"stolen car capital of the world\".",
  "Jefferson invented the dumbwaiter, the monetary system, and the folding attic ladder.",
  "The S in Harry S. Truman did not stand for anything.",
  "In Miconesia, coins are 12 feet across.",
  "A horse can look forward with one eye and back with the other.",
  "Shakespeare is quoted 33,150 times in the Oxford English dictionary.",
  "The word Pennsylvania is misspelled on the Liberty Bell.",
  "NBA superstar Michael Jordan was originally cut from his high school basketball team.",
  "You spend 7 years of your life in the bathroom.",
  "A family of 26 could go to the movies in Mexico city for the price of one in Tokyo.",
  "10,000 Dutch cows pass through the Amsterdam airport each year.",
  "Approximately every seven minutes of every day, someone in an aerobics class pulls their hamstring.",
  "Simplistic passwords contribute to over 80% of all computer password break-ins.",
  "The top 3 health-related searches on the Internet are (in this order): Depression, Allergies, & Cancer.",
  "Dentists have recommended that a toothbrush be kept at least 6 feet away from a toilet to avoid airborne particles resulting from the flush.",
  "Most dust particles in your house are made from dead skin.",
  "Venus is the only planet that rotates clockwise.",
  "Oak trees do not produce acorns until they are fifty years of age or older.",
  "The first owner of the Marlboro company died of lung cancer.",
  "All US Presidents have worn glasses; some just didn't like being seen wearing them in public.",
  "Mosquito repellents don't repel. They hide you. The spray blocks the mosquito's sensors so they don't know you're there.",
  "Walt Disney was afraid of mice.",
  "The site with the highest number of women visitors between the age of 35 and 44 years old: Alka-Seltzer.com",
  "The king of hearts is the only king without a mustache.",
  "Pearls melt in vinegar.",
  "It takes 3,000 cows to supply the NFL with enough leather for a year's supply of footballs.",
  "Thirty-five percent of people who use personal ads for dating are already married.",
  "The 3 most valuable brand names on earth are Marlboro, Coca-Cola, and Budweiser (in that order).",
  "Humans are the only primates that don't have pigment in the palms of their hands.",
  "Months that begin on a Sunday will always have a 'Friday the 13th'.",
  "The fingerprints of koala bears are virtually indistinguishable from those of humans, so much so that they can be easily confused at a crime scene.",
  "The mask worn by Michael Myers in the original \"Halloween\" was actually a Captain Kirk mask painted white.",
  "The only two days of the year in which there are no professional sports games--MLB, NBA, NHL, or NFL--are the day before and the day after the Major League All-Star Game.",
  "Only one person in two billion will live to be 116 or older.",
  "When the French Academy was preparing its first dictionary, it defined \"crab\" as, \"A small red fish, which walks backwards.\" This definition was sent with a number of others to the naturalist Cuvier for his approval.  The scientist wrote back, \"Your definition, gentlemen, would be perfect, only for three exceptions. The crab is not a fish, it is not red and it does not walk backwards.\"",
  "Dr. Jack Kevorkian first patient has Alzheimer's disease.",
  "Fictional/horror writer Stephen King sleeps with a nearby light on to calm his fear of the dark. ",
  "It's possible to lead a cow upstairs but not downstairs.",
  "It was discovered on a space mission that a frog can throw up. The frog throws up its stomach first, so the stomach is dangling out of its mouth. Then the frog uses its forearms to dig out all of the stomach's contents and then swallows the stomach back down.",
  "The very first song played on MTV was 'Video Killed The Radio Star' by the Buggles.",
  "William Marston engineered one of the earliest forms of the polygraph in the early 1900's. Later he went on to create the comic strip Wonder Woman, a story about a displaced Amazon princess who forces anyone caught in her magic lasso to tell the truth",
  "Americans travel 1,144,721,000 miles by air every day",
  "The the U.S. you dial '911'. In Stockholm, Sweden you dial 90000",
  "38% of American men say they love their cars more than women",
  "The U.S. military operates 234 golf courses",
  "100% of lottery winners do gain weight",
  "Bullet proof vests, fire escapes, windshield wipers, and laser printers were all invented by women",
  "A cat has 32 muscles in each ear.",
  "A duck's quack doesn't echo, and no one knows why.",
  "Cats urine glows under a black light.",
  "In every episode of Seinfeld there is a Superman somewhere.",
  "Lorne Greene had one of his nipples bitten off by an alligator while he was host of \"Lorne Greene's Wild Kingdom.\"",
  "Pamela Anderson Lee is Canada's Centennial Baby, being the first baby born on the centennial anniversary of Canada's independence.",
  "Pinocchio is Italian for \"pine head.\"",
  "When possums are playing 'possum', they are not \"playing.\" They actually pass out from sheer terror.",
  "Who's that playing the piano on the \"Mad About You\" theme? Paul Reiser himself.",
  "Winston Churchill was born in a ladies' room during a dance.",
  "Most lipstick contains fish scales!",
  "Donald Duck comics were banned from Finland because he doesn't wear pants!",
  "There are more than 10 million bricks in the Empire State Building!",
  "Camels have three eyelids to protect themselves from blowing sand!",
  "The placement of a donkey's eyes in its' heads enables it to see all four feet at all times!",
  "The average American/Canadian will eat about 11.9 pounds of cereal per year!",
  "Over 1000 birds a year die from smashing into windows!",
  "The state of Florida is bigger than England!",
  "Dolphins sleep with one eye open!",
  "In the White House, there are 13,092 knives, forks and spoons!",
  "Recycling one glass jar, saves enough energy to watch T.V for 3 hours!",
  "Owls are one of the only birds who can see the color blue!",
  "Honeybees have a type of hair on their eyes!",
  "A jellyfish is 95 percent water!",
  "In Bangladesh, kids as young as 15 can be jailed for cheating on their finals!",
  "The katydid bug hears through holes in its hind legs!",
  "Q is the only letter in the alphabet that does not appear in the name of any of the United States!",
  "166,875,000,000 pieces of mail are delivered each year in the US",
  "Bats always turn left when exiting a cave",
  "The praying mantis is the only insect that can turn its head",
  "Daffy Duck's middle name is \"Dumas\"",
  "In Disney's Fantasia, the Sorcerer's name is \"Yensid\" (Disney backwards.)",
  "In The Empire Strikes Back there is a potato hidden in the asteroid field",
  "Walt Disney holds the world record for the most Academy Awards won by one person, he has won twenty statuettes, and twelve other plaques and certificates",
  "James Bond's car had three different license plates in Goldfinger",
  "Canada makes up 6.67 percent of the Earth's land area",
  "South Dakota is the only U.S state which shares no letters with the name of it's capital",
  "The KGB is headquartered at No. 2 Felix Dzerzhinsky Square, Moscow",
  "The Vatican city registered 0 births in 1983",
  "Spain leads the world in cork production",
  "There are 1,792 steps in the Eiffel Tower",
  "There are 269 steps to the top of the Leaning Tower of Pisa",
  "Leonardo da Vinci could write with one hand while drawing with the other",
  "It is impossible to lick your elbow.",
  "Intelligent people have more zinc and copper in their hair.",
  "In every episode of Seinfeld there is a Superman somewhere.",
  "Wearing headphones for just an hour will increase the bacteria in your ear by 700 times.",
  "More than 50% of the people in the world have never made or received a telephone call.",
  "13% of Americans actually believe that some parts of the moon are made of cheese.",
  "The world's youngest parents were 8 and 9 and lived in China in 1910.",
  "Fish that live more than 800 meters below the ocean surface don't have eyes.",
  "Grapes explode when you put them in the microwave. Go on, try it then",
  "Ramses brand condom is named after the great pharaoh Ramses II who fathered over 160 children.",
  "Peanuts are one of the ingredients of dynamite.",
  "The average chocolate bar has 8 insects' legs in it.",
  "In York, it is perfectly legal to shoot a Scotsman with a bow and arrow (except on Sundays)",
  "No piece of square dry paper can be folded in half more than 7 times",
  "The average human eats 8 spiders in their lifetime at night.",
  "\"Stewardesses\" is the longest word typed with only the left hand.",
  "An average human loses about 200 head hairs per day.",
  "Mexico City sinks about 10 inches a year",
  "It's impossible to sneeze with your eyes open.",
  "In France, a five year old child can buy an alcoholic drink in a bar",
  "During the chariot scene in \"Ben Hur,\" a small red car can be seen in the distance.",
  "Because metal was scarce, the Oscars given out during World War II were made of wood.",
  "By raising your legs slowly and lying on your back, you cannot sink into quicksand.",
  "Venus is the only planet that rotates clockwise.",
  "Charlie Chaplin once won third prize in a Charlie Chaplin look-alike contest.",
  "The glue on Israeli postage is certified kosher.",
  "In 10 minutes, a hurricane releases more energy than all of the world's nuclear weapons combined.",
  "On average, 100 people choke to death on ball-point pens every year.",
  "Thirty-five percent of the people who use personal ads for dating are already married.",
  "The electric chair was invented by a dentist.",
  "Bruce Lee was so fast that they actually had to s-l-o-w film down so you could see his moves.",
  "A Boeing 747s wingspan is longer than the Wright brother's first flight.",
  "Babies are born without knee caps. They don't appear until the child reaches 2-6 years of age.",
  "14% of all facts and statistics are made up and 27% of people know that fact.",
  "Every time you lick a stamp, you're consuming 1/10 of a calorie.",
  "Eskimos have over 15 words for the English word of 'Snow'",
  "Americans on the average eat 18 acres of pizza every day.",
  "Banging your head against a wall uses 150 calories an hour.",
  "On a Canadian two dollar bill, the flag flying over the Parliament buildings is an American flag.",
  "Almonds are a member of the peach family.",
  "The plastic things on the end of shoelaces are called aglets.",
  "\"Ithyphallophobia\" is a morbid fear of seeing, thinking about or having an erect penis.",
  "The average shelf-life of a latex condom is about two years.",
  "14% of Americans have skinny-dipped with a member of the opposite sex at least once.",
  "Male bats have the highest rate of homosexuality of any mammal.",
  "A man's beard grows fastest when he anticipates sex.",
  "A man will ejaculate approximately 18 quarts of semen in his lifetime.",
  "Sex is biochemically no different from eating large quantities of chocolate.",
  "Humans and dolphins are the only species that have sex for pleasure.",
  "For every 'normal' webpage, there are five porn pages.",
  "\"Venus observa\" is the technical term for the \"missionary position.\"",
  "Sex is the safest tranquilizer in the world. IT IS 10 TIMES MORE EFFECTIVE THAN VALIUM.",
  "Samuel Clemens (Mark Twain) was born on and died on days when Halley’s Comet can be seen.",
  "US Dollar bills are made out of cotton and linen.",
  "The 57 on the Heinz ketchup bottle represents the number of pickle types the company once had.",
  "Americans are responsible for about 1/5 of the world’s garbage annually.",
  "Giraffes and rats can last longer without water than camels.",
  "Your stomach produces a new layer of mucus every two weeks so that it doesn’t digest itself.",
  "98% of all murders and rapes are by a close family member or friend of the victim.",
  "A B-25 bomber crashed into the 79th floor of the Empire State Building on July 28, 1945.",
  "The Declaration of Independence was written on hemp (marijuana) paper.",
  "The dot over the letter \"i\" is called a tittle.",
  "Benjamin Franklin was the fifth in a series of the youngest son of the youngest son.",
  "Triskaidekaphobia means fear of the number 13.",
  "Paraskevidekatriaphobia means fear of Friday the 13th, which occurs one to three times a year.",
  "In Italy, 17 is considered an unlucky number. In Japan, 4 is considered an unlucky number.",
  "A female ferret will die if it goes into heat and cannot find a mate.",
  "In ancient Rome, when a man testified in court he would swear on his testicles.",
  "The ZIP in \"ZIP code\" means Zoning Improvement Plan.",
  "Coca-Cola contained Coca (whose active ingredient is cocaine) from 1885 to 1903.",
  "A \"2 by 4\" is really 1 1/2 by 3 1/2.",
  "It’s estimated that at any one time around 0.7% of the world’s population is drunk.",
  "40% of McDonald’s profits come from the sales of Happy Meals.",
  "Every person, including identical twins, has a unique eye & tongue print along with their finger print.",
  "The \"spot\" on the 7-Up logo comes from its inventor who had red eyes. He was an albino.",
  "315 entries in Webster’s 1996 dictionary were misspelled.",
  "The \"save\" icon in Microsoft Office programs shows a floppy disk with the shutter on backwards.",
  "Albert Einstein and Charles Darwin both married their first cousins",
  "Camel’s have three eyelids.",
  "On average, 12 newborns will be given to the wrong parents every day.",
  "John Wilkes Booth’s brother once saved the life of Abraham Lincoln’s son.",
  "Warren Beatty and Shirley McLaine are brother and sister.",
  "Chocolate can kill dogs; it directly affects their heart and nervous system.",
  "Daniel Boone hated coonskin caps.",
  "55.1% of all US prisoners are in prison for drug offenses.",
  "Most lipstick contains fish scales.",
  "Dr. Seuss pronounced his name \"soyce\".",
  "Slugs have four noses.",
  "Ketchup was sold in the 1830s as medicine.",
  "India has a Bill of Rights for cows.",
  "American Airlines saved $40,000 in 1987 by taking out an olive from First Class salads.",
  "About 200,000,000 M&Ms are sold each day in the United States.",
  "Because metal was scarce, the Oscars given out during World War II were made of wood.",
  "There are 318,979,564,000 possible combinations of the first four moves in Chess.",
  "There are no clocks in Las Vegas gambling casinos.",
  "Coconuts kill about 150 people each year. That’s more than sharks.",
  "Half of all bank robberies take place on a Friday.",
  "The name Wendy was made up for the book Peter Pan. There was never a recorded Wendy before it.",
  "The international telephone dialing code for Antarctica is 672.",
  "The first bomb the Allies dropped on Berlin in WWII killed the only elephant in the Berlin Zoo.",
  "The average raindrop falls at 7 miles per hour.",
  "If you put a drop of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "Bruce Lee was so fast that they had to slow the film down so you could see his moves.",
  "The first CD pressed in the US was Bruce Springsteen’s \"Born in the USA\".",
  "IBM’s motto is \"Think\". Apple later made their motto \"Think different\".",
  "The original name for butterfly was flutterby.",
  "One in fourteen women in America is a natural blonde. Only one in sixteen men is.",
  "The Olympic was the sister ship of the Titanic, and she provided twenty-five years of service.",
  "When the Titanic sank, 2228 people were on it. Only 706 survived.",
  "Every day, 7% of the US eats at McDonald’s.",
  "During his entire life, Vincent Van Gogh sold exactly one painting, \"Red Vineyard at Arles\".",
  "By raising your legs slowly and lying on your back, you cannot sink into quicksand.",
  "One in ten people live on an island.",
  "It takes more calories to eat a piece of celery than the celery has in it to begin with.",
  "28% of Africa is classified as wilderness. In North America, its 38%.",
  "Charlie Chaplin once won third prize in a Charlie Chaplin look-alike contest.",
  "Chewing gum while peeling onions will keep you from crying.",
  "Sherlock Holmes NEVER said \"Elementary, my dear Watson\"",
  "Humphrey Bogart NEVER said \"Play it again, Sam\" in Casablanca",
  "They NEVER said \"Beam me up, Scotty\" on Star Trek.",
  "Sharon Stone was the first Star Search spokes model.",
  "More people are afraid of open spaces (kenophobia) than of tight spaces (claustrophobia).",
  "The glue on Israeli postage is certified kosher.",
  "There is a 1 in 4 chance that New York will have a white Christmas.",
  "The Guinness Book of Records holds the record for being the book most often stolen from Libraries.",
  "Thirty-five percent of the people who use personal ads for dating are already married.",
  "$203,000,000 is spent on barbed wire each year in the U.S.",
  "Every US president has worn glasses (just not always in public).",
  "Bats always turn left when exiting a cave.",
  "Jim Henson first coined the word \"Muppet\". It is a combination of \"marionette\" and \"puppet.\"",
  "The Michelin man is known as Mr. Bib. His name was Bibendum in the company’s first ads in 1896.",
  "The word \"lethologica\" describes the state of not being able to remember the word you want.",
  "About 14% of injecting drug users are HIV positive.",
  "A word or sentence that is the same front and back (racecar, kayak) is called a \"palindrome\".",
  "A snail can sleep for 3 years.",
  "People photocopying their buttocks are the cause of 23% of all photocopier faults worldwide.",
  "China has more English speakers than the United States.",
  "One in every 9000 people is an albino.",
  "The electric chair was invented by a dentist.",
  "You share your birthday with at least 9 million other people in the world.",
  "Everyday, more money is printed for Monopoly sets than for the U.S. Treasury.",
  "Every year 4 people in the UK die putting their trousers on.",
  "Cats have over one hundred vocal sounds; dogs only have about ten.",
  "Our eyes are always the same size from birth but our nose and ears never stop growing.",
  "In every episode of \"Seinfeld\" there is a Superman picture or reference somewhere.",
  "Rats multiply so quickly that in 18 months, two rats could have over million descendants.",
  "Wearing headphones for just an hour will increase the bacteria in your ear by 700 times.",
  "Each year in America there are about 300,000 deaths that can be attributed to obesity.",
  "About 55% of all movies are rated R.",
  "About 500 movies are made in the US and 800 in India annually.",
  "Arabic numerals are not really Arabic; they were created in India.",
  "The February of 1865 is the only month in recorded history not to have a full moon.",
  "There is actually no danger in swimming right after you eat, though it may feel uncomfortable.",
  "The cruise liner Queen Elizabeth II moves only six inches for each gallon of diesel that it burns.",
  "More than 50% of the people in the world have never made or received a telephone call.",
  "A shark is the only fish that can blink with both eyes.",
  "There are about 2 chickens for every human in the world.",
  "The word \"maverick\" came into use after Samuel Maverick, a Texan refused to brand his cattle.",
  "Two-thirds of the world’s eggplant is grown in New Jersey.",
  "On a Canadian two-dollar bill, the American flag is flying over the Parliament Building.",
  "An American urologist bought Napoleon’s penis for $40,000.",
  "No word in the English language rhymes with month, orange, silver, or purple.",
  "Dreamt is the only English word that ends in the letters \"MT\".",
  "$283,200 is the absolute highest amount of money you can win on Jeopardy.",
  "Almonds are members of the peach family.",
  "Rats and horses can’t vomit.",
  "The penguin is the only bird that can’t fly but can swim.",
  "There are approximately 100 million acts of sexual intercourse each day.",
  "Winston Churchill was born in a ladies room during a dance.",
  "Maine is the only state whose name is just one syllable.",
  "Americans on average eat 18 acres of pizza every day.",
  "Every time you lick a stamp you consume 1/10 of a calorie.",
  "You are more likely to be killed by a champagne cork than by a poisonous spider.",
  "Hedenophobic means fear of pleasure.",
  "Ancient Egyptian priests would pluck every hair from their bodies.",
  "A crocodile cannot stick its tongue out.",
  "80% of burglaries are committed by people aged 13-21.",
  "An ant always falls over on its right side when intoxicated.",
  "All polar bears are left-handed.",
  "The catfish has over 27000 taste buds (more than any other animal)",
  "A cockroach will live nine days without its head before it starves to death.",
  "Butterflies taste with their feet.",
  "Elephants are the only mammals that cannot jump.",
  "An ostrich’s eye is bigger than its brain.",
  "Starfish have no brains.",
  "11% of the world is left-handed.",
  "Rubber bands last longer when refrigerated.",
  "The national anthem of Greece has 158 verses.",
  "There are 293 ways to make change for a dollar.",
  "A healthy (non-colorblind) human eye can distinguish between 500 shades of gray.",
  "A pregnant goldfish is called a twit.",
  "Lizards can self-amputate their tails for protection. It grows back after a few months.",
  "Los Angeles’ full name is \"El Pueblo de Nuestra Senora la Reina de los Angeles de Porciuncula\".",
  "A cat has 32 muscles in each ear.",
  "A honeybee can fly at fifteen miles per hour.",
  "Tigers have striped skin, not just striped fur.",
  "A \"jiffy\" is the scientific name for 1/100th of a second.",
  "The average child recognizes over 200 company logos by the time he enters first grade.",
  "The youngest pope ever was 11 years old.",
  "The first novel ever written on a typewriter is Tom Sawyer.",
  "One out of every 43 prisoners escapes from jail. 94% are recaptured.",
  "The average chocolate bar has 8 insects’ legs melted into it.",
  "A rhinoceros horn is made of compacted hair.",
  "Elwood Edwards did the voice for the AOL sound files (i.e. \"You’ve got Mail!\").",
  "A polar bears skin is black. Its fur is actually clear, but like snow it appears white.",
  "Elvis had a twin brother named Garon, who died at birth, which is why Elvis middle name was Aron.",
  " Dueling is legal in Paraguay as long as both parties are registered blood donors.",
  "Donkeys kill more people than plane crashes.",
  "Shakespeare invented the words \"assassination\" and \"bump.\"",
  "There are a million ants for every person on Earth.",
  "If you keep a goldfish in the dark room, it will eventually turn white.",
  "Women blink nearly twice as much as men.",
  "The name Jeep comes from \"GP\", the army abbreviation for General Purpose.",
  "Right handed people live, on average, nine years longer than left handed people do.",
  "There are two credit cards for every person in the United States.",
  "Cats’ urine glows under a black light.",
  "A \"quidnunc\" is a person who is eager to know the latest news and gossip.",
  "Leonardo Da Vinci invented the scissors, the helicopter, and many other present day items.",
  "In the last 4000 years no new animals have been domesticated.",
  "25% of a human’s bones are in its feet.",
  "On average, 100 people choke to death on ballpoint pens every year.",
  "\"Canada\" is an Indian word meaning \"Big Village\".",
  "Only one in two billion people will live to be 116 or older.",
  "Rape is reported every six minutes in the U.S.",
  "The human heart creates enough pressure in the bloodstream to squirt blood 30 feet.",
  "A jellyfish is 95% water.",
  "Truck driving is the most dangerous occupation by accidental deaths (799 in 2001).",
  "Banging your head against a wall uses 150 calories an hour.",
  "Elephants only sleep for two hours each day.",
  "On average people fear spiders more than they do death.",
  "The strongest muscle in the human body is the tongue. (the heart is not a muscle)",
  "In golf, a ‘Bo Derek’ is a score of 10.",
  "In the U.S, Frisbees outsell footballs, baseballs and basketballs combined.",
  "In most watch advertisements the time displayed on a watch is 10:10.",
  "If you plant an apple seed, it is almost guaranteed to grow a tree of a different type of apple.",
  "Al Capone’s business card said he was a used furniture dealer.",
  "The only real person to be a PEZ head was Betsy Ross.",
  "There are about 450 types of cheese in the world. 240 come from France.",
  "A dragonfly has a lifespan of 24 hours.",
  "In Iceland, a Big Mac costs $5.50.",
  "Broccoli and cauliflower are the only vegetables that are flowers.",
  "There is no solid proof of who built the Taj Mahal.",
  "In a survey of 200000 ostriches over 80 years, not one tried to bury its head in the sand.",
  "A dime has 118 ridges around the edge. A quarter has 119.",
  "\"Judge Judy\" has a $25,000,000 salary, while Supreme Court Justice Ginsberg has a $190,100 salary.",
  "Andorra, a tiny country between France & Spain, has the longest average lifespan: 83.49 years.",
  "Mr. Rogers was an ordained Presbyterian minister.",
  "In America you will see an average of 500 advertisements a day.",
  "John Lennon’s first girlfriend was named Thelma Pickles.",
  "You can lead a cow upstairs but not downstairs.",
  "The average person falls asleep in seven minutes.",
  "\"The sixth sick sheik’s sixth sheep’s sick\" is said to be the toughest tongue twister in English.",
  "There are 336 dimples on a regulation US golf ball. In the UK its 330.",
  "\"Duff\" is the decaying organic matter found on a forest floor.",
  "The US has more personal computers than the next 7 countries combined.",
  "Kuwait is about 60% male (highest in the world). Latvia is about 54% female (highest in the world).",
  "The Hawaiian alphabet has only 12 letters.",
  "In 10 minutes, a hurricane releases more energy than all the world’s nuclear weapons combined.",
  "At the height of its power in 400 BC, the Greek city of Sparta had 25,000 citizens and 500,000 slaves.",
  "Julius Caesar’s autograph is worth about $2,000,000.",
  "People say \"bless you\" when you sneeze because your heart stops for a millisecond.",
  "US gold coins used to say \"In Gold We Trust\".",
  "In \"Silence of the Lambs\", Hannibal Lector (Anthony Hopkins) never blinks.",
  "A shrimp’s heart is in its head.",
  "In the 17th century, the value of pi was known to 35 decimal places. Today, to 1.2411 trillion.",
  "Pearls melt in vinegar.",
  "\"Lassie\" was played by a group of male dogs; the main one was named Pal.",
  "Nepal is the only country that doesn’t have a rectangular flag.",
  "Switzerland is the only country with a square flag.",
  "Gabriel, Michael, and Lucifer are the only angels named in the Bible.",
  "Johnny Appleseed planted apples so that people could use apple cider to make alcohol.",
  "Abraham Lincoln’s ghost is said to haunt the White House.",
  "God is not mentioned once in the book of Esther.",
  "The odds of being born male are about 51.2%, according to census.",
  "Scotland has more redheads than any other part of the world.",
  "There is an average of 61,000 people airborne over the US at any given moment.",
  "Prince Charles and Prince William never travel on the same airplane in case there is a crash.",
  "The most popular first name in the world is Muhammad.",
  "The surface of the Earth is about 60% water and 10% ice.",
  "For every 230 cars that are made, 1 will be stolen.",
  "Jimmy Carter was the first U.S. President to be born in a hospital.",
  "Lightning strikes the earth about 8 million times a day.",
  "Humans use a total of 72 different muscles in speech.",
  "If you feed a seagull Alka-Seltzer, its stomach will explode.",
  "Only female mosquitoes bite.",
  "The U.S. Post Office handles 43 percent of the world’s mail.",
  "Most household dust is made of dead skin cells.",
  "One in eight million people has progeria, a disease that causes people to grow faster than they age.",
  "The male seahorse carries the eggs until they hatch instead of the female.",
  "Negative emotions such as anxiety and depression can weaken your immune system.",
  "Stephen Hawking was born exactly 300 years after Galileo died.",
  "Mercury is the only planet whose orbit is coplanar with its equator.",
  "Venus and Uranus are the only planets that rotate opposite to the direction of their orbit.",
  "John Adams, Thomas Jefferson, and James Monroe died on July 4th.",
  "Baby Ruth candy bar was named after Grover Cleveland’s daughter, Ruth, not the baseball player.",
  "Dolphins can look in different directions with each eye. They can sleep with one eye open.",
  "The Falkland Isles (pop. about 2000) has over 700000 sheep (350 per person).",
  "There are 41,806 different spoken languages in the world today.",
  "The city of Venice stands on about 120 small islands.",
  "The past-tense of the English word \"dare\" is \"durst\"",
  "Beetles taste like apples, wasps like pine nuts, and worms like fried bacon.",
  "Of all the words in the English language, the word 'set' has the most definitions!",
  "What is called a \"French kiss\" in the English speaking world is known as an \"English kiss\" in France.",
  "\"Almost\" is the longest word in the English language with all the letters in alphabetical order.",
  "\"Rhythm\" is the longest English word without a vowel.",
  "In 1386, a pig in France was executed by public hanging for the murder of a child",
  "A cockroach can live several weeks with its head cut off!",
  "Human thigh bones are stronger than concrete.",
  "You can't kill yourself by holding your breath",
  "There is a city called Rome on every continent.",
  "Your heart beats over 100,000 times a day!",
  "The skeleton of Jeremy Bentham is present at all important meetings of the University of London",
  "Right handed people live, on average, nine years longer than left-handed people",
  "Your ribs move about 5 million times a year, every time you breathe!",
  "One quarter of the bones in your body, are in your feet!",
  "Like fingerprints, everyone's tongue print is different!",
  "Fingernails grow nearly 4 times faster than toenails!",
  "Most dust particles in your house are made from dead skin!",
  "Present population of 5 billion plus people of the world is predicted to become 15 billion by 2080.",
  "Women blink nearly twice as much as men.",
  "Adolf Hitler was a vegetarian, and had only ONE testicle.",
  "Honey is the only food that does not spoil.",
  "Months that begin on a Sunday will always have a \"Friday the 13th.\"",
  "Coca-Cola would be green if coloring weren’t added to it.",
  "On average a hedgehog's heart beats 300 times a minute.",
  "More people are killed each year from bees than from snakes.",
  "The average lead pencil will draw a line 35 miles long or write approximately 50,000 English words.",
  "More people are allergic to cow's milk than any other food.",
  "Camels have three eyelids to protect themselves from blowing sand.",
  "The placement of a donkey's eyes in it’s' heads enables it to see all four feet at all times!",
  "The six official languages of the U.N. are: English, French, Arabic, Chinese, Russian and Spanish.",
  "Earth is the only planet not named after a god.",
  "It's against the law to burp, or sneeze in a church in Nebraska, USA.",
  "You're born with 300 bones, but by the time you become an adult, you only have 206.",
  "Some worms will eat themselves if they can't find any food!",
  "The world’s oldest piece of chewing gum is 9000 years old!",
  "The longest recorded flight  of a chicken is 13 seconds",
  "Owls are the only birds that can see the color blue.",
  "A man named Charles Osborne had the hiccups for 69 years!",
  "A giraffe can clean its ears with its 21-inch tongue!",
  "The average person laughs 10 times a day!",
  "The Bible, the world's best-selling book, is also the world's most shoplifted book.",
  "Someone paid $14,000 for the bra worn by Marilyn Monroe in the film 'Some Like It Hot'.",
  "Your tongue is the only muscle in your body that is attached at only one end.",
  "More than 1,000 different languages are spoken on the continent of Africa.",
  "Buckingham Palace in England has over six hundred rooms.",
  "There was once an undersea post office in the Bahamas.",
  "Ninety percent of New York City cabbies are recently arrived immigrants.",
  "It's possible to lead a cow upstairs...but not downstairs.",
  "A snail can sleep for three years. ",
  "No word in the English language rhymes with \"MONTH\".",
  "Average life span of a major league baseball: 7 pitches.",
  "Our eyes are always the same size from birth, but our nose and ears never stop growing.",
  "\"Go.\" is the shortest complete sentence in the English language.",
  "The \"pound\" key on your keyboard (#) is called an octotroph. ",
  "The only domestic animal not mentioned in the Bible is the cat. ",
  "Table tennis balls have been known to travel off the paddle at speeds up to 160 km/hr. ",
  "Pepsi originally contained pepsin, thus the name. ",
  "The original story from \"Tales of 1001 Arabian Nights\" begins, \"Aladdin was a little Chinese boy.\" ",
  "Nutmeg is extremely poisonous if injected intravenously. ",
  "Honey is the only natural food that is made without destroying any kind of life.",
  "The volume of the earth's moon is the same as the volume of the Pacific Ocean. ",
  "Cephalacaudal recapitulation is the reason our extremities develop faster than the rest of us. ",
  "Chinese Crested dogs can get acne. ",
  "Each year there is one ton of cement poured for each man woman and child in the world. ",
  "The house fly hums in the middle octave key of F. ",
  "The only capital letter in the Roman alphabet with exactly one end point is P. ",
  "The giant red star Betelgeuse has a diameter larger than that of the Earth's orbit around the sun. ",
  "Hummingbirds are the only animals that can fly backwards. ",
  "A cat's jaw cannot move sideways.",
  "The human heart creates enough pressure when it pumps out to the body to squirt blood 30 feet.",
  "The flea can jump 350 times its body length. It's like a human jumping the length of a football field.",
  "Some lions mate over 50 times a day.",
  "Rubber bands last longer when refrigerated. ",
  "The average person's left hand does 56% of the typing. ",
  "The longest one-syllable word in the English language is \"screeched.\" ",
  "All of the clocks in the movie \"Pulp Fiction\" are stuck on 4:20. ",
  "\"Dreamt\" is the only English word that ends in the letters \"mt.\" ",
  "Maine is the only state (in USA) whose name is just one syllable. ",
  "The giant squid has the largest eyes in the world. ",
  "In England, the Speaker of the House is not allowed to speak. ",
  "Mr. Rogers was an ordained minister. ",
  "A rat can last longer without water than a camel.",
  "Your stomach has to produce a new layer of mucus every two weeks or it will digest itself.",
  "A female ferret will die if it goes into heat and cannot find a mate.",
  "A 2\" X 4\" is really 1-1/2\" by 3-1/2\".",
  "On average, 12 newborns will be given to the wrong parents daily.",
  "There are no words in the dictionary that rhyme with orange, purple, silver and month.",
  "If one places a tiny amount of liquor on a scorpion, it will instantly go mad and sting itself to death.",
  "The first CD pressed in the US was Bruce Springsteen's \"Born in the USA.\"",
  "Sherlock Holmes NEVER said, \"Elementary, my dear Watson.\"",
  "California consumes more bottled water than any other product.",
  "California has issued 6 drivers licenses to people named \"Jesus Christ.\"",
  "In 1980, a Las Vegas hospital suspended workers for betting on when patients would die.",
  "Nevada is the driest state in the U.S.. Each year it averages 7.5 inches (19 cm) of rain.",
  "In Utah, it is illegal to swear in front of a dead person.",
  "Salt Lake City, Utah has a law against carrying an unwrapped ukulele on the street.",
  "Arizona was the last of the 48 adjoining continental states to enter the Union.",
  "It is illegal to hunt camels in the state of Arizona.",
  "Wyoming was the first state to give women the right to vote in 1869.",
  "Denver, Colorado lays claim to the invention of the cheeseburger.",
  "The first license plate on a car in the United States was issued in Denver, Colorado in 1908.",
  "The state of Maryland has no natural Lakes.",
  "Illinois has the highest number of personalized license plates than any other state.",
  "Residents of Houston, Texas lead the U.S. in eating out - approximately 4.6 times per week.",
  "Laredo, Texas is the U.S.'s farthest inland port.",
  "Rugby, North Dakota is the geographical center of North America.",
  "Butte County, South Dakota is the geographical center of the U.S.",
  "Louisiana's capital building is the tallest one of any U.S. state.",
  "Hawaii is the only coffee producing state.",
  "One in seven workers in Boston, Massachusetts walks to work.",
  "The \"Dull Men's Hall of Fame\" is located in Carroll, Wisconsin.",
  "Gary, Indiana is the murder capital of the U.S. - probably the world.",
  "Alabama was the first state to recognize Christmas as an official holiday.",
  "The largest NFL stadium is the Pontiac Silverdome in Detroit, Michigan.",
  "Michigan was the first state to have roadside picnic tables.",
  "No matter where you stand in Michigan, you are never more than 85 miles from a Great Lake.",
  "The official beverage of Ohio is tomato juice.",
  "Georgia's state motto is \"Wisdom, Justice and Moderation.\"",
  "The U.S. city with the highest rate of lightning strikes per capita is Clearwater, Florida.",
  "It's illegal to spit on the sidewalk in Norfolk, Virginia.",
  "The first streetlights in America were installed in Philadelphia around 1757.",
  "The highest point in Pennsylvania is lower than the lowest point in Colorado.",
  "If you were to take a taxicab from New York City to Los Angeles, it would cost you $8,325.",
  "The NY phone book had 22 Hitlers before WWII. The NY phone book had 0 Hitlers after WWII.",
  "In New York State, it is illegal to but any alcohol on Sundays before noon.",
  "There were 240 pedestrian fatalities in New York City in 1994.",
  "Columbia University is the second largest landowner in New York City, after the Catholic Church.",
  "Montpelier, Vermont is the only state capital without a McDonalds.",
  "Maine is the only state that has borders with only one other state.",
  "The first McDonald's restaurant in Canada was in Richmond, British Columbia.",
  "In 1984, a Canadian farmer began renting advertising space on his cows.",
  "There are more donut shops in Canada per capita than any other country.",
  "0.3% of all road accidents in Canada involve a Moose.",
  "In the great fire of London in 1666 half of London was burnt down but only 6 people were injured.",
  "In Quebec, there is an old law that states margarine must be a different color than butter.",
  "The largest taxi fleet in the world is found in Mexico City. The city boasts a fleet of over 60,000 taxis.",
  "More than 90% of the Nicaraguan people are Roman Catholic.",
  "Cuba is the only island in the Caribbean to have a railroad.",
  "Jamaica has the most churches per square mile than any other country in the world.",
  "The angel falls in Venezuela are nearly 20 times taller than Niagara Falls.",
  "Canada is the only country not to win a gold medal in the summer Olympic games while hosting.",
  "The Amazon is the world's largest river, 3,890 miles (6,259 km) long.",
  "The town of Calma, Chile in the Atacama Desert has never had rain.",
  "The people of France eat more cheese than any other country in the world.",
  "King Louis XIX ruled France for 15 minutes.",
  "The most common name in Italy is Mario Rossi.",
  "Greece's national anthem has 158 verses.",
  "In ancient Greece \"idiot\" meant a private citizen or layman.",
  "Bulgarians are known to be the biggest yogurt eaters in the world.",
  "Czechs are the biggest consumers of beer per male in the world.",
  "A Czech man, Jan Honza Zampa, holds the record for drinking one liter of beer in 4.11 seconds.",
  "Netherlands is the only country with a national dog.",
  "When we think of Big Ben in London, we think of the clock. Actually, it's the bell.",
  "The Automated Teller Machine (ATM) was introduced in England in 1965.",
  "Buckingham Palace has 602 rooms.",
  "Icelanders consume more Coca-Cola per Capita than any other nation.",
  "Until 1997, there were more pigs than people in Denmark.",
  "There is a hotel in Sweden built entirely out of ice; it is rebuilt every year.",
  "Sweden has the least number of murders annually.",
  "Lithuania has the highest suicide rate in the world.",
  "The country code for Russia is \"007\".",
  "Russians generally answer the phone by saying, \"I'm listening\".",
  "The U.S. bought Alaska for 2 cents an acre from Russia.",
  "1 in 5 of the world's doctors are Russian.",
  "Antarctica is the only continent that does not have land areas below sea level.",
  "The people of Israel consume more turkeys per capita than any other country.",
  "Nepal is the only country that has a non-rectangular flag. It is also asymmetrical.",
  "1,800 cigarettes are smoked per person each year in China.",
  "Respiratory Disease is China's leading cause of death.",
  "There are more than 40,000 characters in the Chinese script.",
  "More people speak English in China than the United States.",
  "The toothbrush was invented in China in 1498.",
  "Mongolia is the largest landlocked country.",
  "Vatican City is the smallest country in the world, with a population of 1000 and just 108.7 acres.",
  "In Japan, watermelons are squared. It's easier to stack them that way.",
  "98% of Japanese are cremated.",
  "The number \"four\" is considered unlucky in Japan because it is pronounced the same as \"death\".",
  "The average Japanese household watches more than 10 hours of television a day.",
  "The Philippines has about 7,100 islands, of which only about 460 are more than 1 square mile in area.",
  "Yo-yos were used as weapons by warriors in the Philippines in the 16th century.",
  "Australian soldiers used the song \"We're Off to See the Wizard\" as a marching song in WWII.",
  "The Australian $5 to $100 notes are made of plastic.",
  "The Nullarbor Plain of Australia covers 100,000 square miles (160,900 km) without a tree.",
  "Tasmania, Australia has the cleanest air in the inhabited world.",
  "Greenland is the largest island in the world.",
  "The first female guest host of \"Saturday Night Live\" was Candace Bergen.",
  "In 1933, Mickey Mouse, an animated cartoon character, received 800,000 fan letters.",
  "The Simpsons is the longest running animated series on TV.",
  "The first toilet ever seen on television was on \"Leave It to Beaver.\"",
  "In every episode of Seinfeld there is a Superman somewhere.",
  "The average human brain has about 100 billion nerve cells.",
  "Nerve impulses to and from the brain travel as fast as 170 miles (274 km) per hour.",
  "The thyroid cartilage is more commonly known as the adams apple.",
  "Your stomach needs to produce a new layer of mucus every two weeks or it would digest itself.",
  "The average life of a taste bud is 10 days.",
  "The average cough comes out of your mouth at 60 miles (96.5 km) per hour.",
  "Relative to size, the strongest muscle in the body is the tongue.",
  "When you sneeze, all your bodily functions stop even your heart.",
  "Babies are born without knee caps. They don't appear until the child reaches 2-6 years of age.",
  "Right handed people live, on average, nine years longer than left handed people do.",
  "Children grow faster in the springtime.",
  "It takes the stomach an hour to break down cows’ milk.",
  "Women blink nearly twice as much as men.",
  "Blondes have more hair than dark-haired people do.",
  "There are 10 human body parts that are only 3 letters long (eye hip arm leg ear toe jaw rib lip gum).",
  "If you go blind in one eye you only lose about one fifth of your vision but all your sense of depth.",
  "The average human head weighs about 8 pounds.",
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "An average human scalp has 100,000 hairs.",
  "The average human blinks their eyes 6,205,000 times each year.",
  "Your skull is made up of 29 different bones.",
  "Ancient Egyptians shaved off their eyebrows to mourn the deaths of their cats.",
  "Hair is made from the same substance as fingernails.",
  "The surface of the human skin is 6.5 square feet (2m).",
  "15 million blood cells are destroyed in the human body every second.",
  "The pancreas produces Insulin.",
  "The most sensitive cluster of nerves is at the base of the spine.",
  "The human body is comprised of 80% water.",
  "The average human will shed 40 pounds of skin in a lifetime.",
  "Human thighbones are stronger than concrete.",
  "There are 45 miles of nerves in the skin of a human being.",
  "Canadian researchers have found that Einstein's brain was 15% wider than normal.",
  "While in Alcatraz, Al Capone was inmate #85.",
  "Astronaut Neil Armstrong first stepped on the moon with his left foot.",
  "Jim Morrison, of the 60's rock group The Doors, was the first rock star to be arrested on stage.",
  "Frank Lloyd Wright's son invented Lincoln Logs.",
  "Peter Falk, who played \"Columbo,\" has a glass eye.",
  "Barbie's full name is \"Babara Millicent Roberts.\"",
  "The mother of Michael Nesmith of \"The Monkees\" invented whiteout.",
  "Isaac Asimov is the only author to have a book in every Dewey-decimal category.",
  "Shakespeare invented the word \"assassination\" and \"bump.\"",
  "Leonardo Da Vinci invented the scissors.",
  "Adolf Hitler's mother seriously considered having an abortion but was talked out of it by her doctor.",
  "Marilyn Monroe had six toes.",
  "The shortest British monarch was Charles I, who was 4 feet 9 inches.",
  "Tina Turner's real name is Annie Mae Bullock.",
  "Beethoven dipped his head in cold water before he composed.",
  "President John F Kennedy could read 4 newspapers in 20 minutes.",
  "Bob Dylan's real name is Robert Zimmerman.",
  "Sigmund Freud had a morbid fear of ferns.",
  "Anne Boleyn, Queen Elizabeth I's mother, had six fingers on one hand.",
  "Orville Wright was involved in the first aircraft accident. His passenger, a Frenchman, was killed.",
  "The sound of E.T. walking was made by someone squishing her hands in jelly.",
  "Cher's last name was \"Sarkissian.\" She changed it because no one could pronounce it.",
  "Sugar was first added to chewing gum in 1869 by a dentist, William Semple.",
  "Paper was invented early in the second century by Chinese eunuch.",
  "Sir Isaac Newton was only 23 years old when he discovered the law of universal gravitation.",
  "Hannibal had only one eye after getting a disease while attacking Rome.",
  "A blue whales heart only beats nine times per minute.",
  "A cat uses its whiskers to determine if a space is too small to squeeze through.",
  "A chameleon's tongue is twice the length of its body.",
  "A crocodiles tongue is attached to the roof of its mouth.",
  "Rodent's teeth never stop growing.",
  "A shark can detect one part of blood in 100 million parts of water.",
  "The penguin is the only bird that can swim but can't fly.",
  "The cheetah is the only cat that can't retract its claws.",
  "A lion's roar can be heard from five miles away.",
  "Emus and kangaroos can't walk backwards.",
  "Cats have over 100 vocal sounds; dogs only have 10.",
  "A mole can dig a tunnel 300 feet (91 m) long in just one night.",
  "Insects outnumber humans 100,000,000 to one.",
  "Sharkskin has tiny tooth-like scales all over.",
  "Chameleons can move their eyes in two directions at the same time.",
  "Koalas never drink water. They get fluids from the eucalyptus leaves they eat.",
  "A cow gives nearly 200,000 glasses of milk in her lifetime.",
  "When sharks take a bite, their eyes roll back and their teeth jut out.",
  "Camels chew in a figure 8 pattern.",
  "Proportional to their size, cats have the largest eyes of all mammals.",
  "Sailfish can leap out of the water and into the air at a speed of 50 miles (81 km) per hour.",
  "The catfish has the most taste buds of all animals, having over 27,000 of them.",
  "A skunk's smell can be detected by a human a mile away.",
  "A lion in the wild usually makes no more than 20 kills a year.",
  "In space, astronauts cannot cry, because there is no gravity, so the tears can't flow.",
  "The state of Florida is bigger than England.",
  "One in every 4 Americans has appeared on television.",
  "The average American/Canadian will eat about 11.9 pounds of cereal per year!",
  "There are over 58 million dogs in the US",
  "Dogs and cats consume over $11 billion worth of pet food a year",
  "Baby robins eat 14 feet of earthworms every day",
  "In Raiders of the Lost Ark there is a wall carving of R2-D2 and C-3P0 behind the ark",
  "\"I\" is the most spoken word in the English language",
  "\"You\" is the second most spoken English word",
  "Spain leads the world in cork production",
  "There are 1,792 steps in the Eiffel Tower",
  "There is a city in Norway called \"Hell\"",
  "The human brain uses the same amount of energy as a 10-watt light bulb",
  "The human feet perspire half a pint of fluid a day",
  "An Olympic gold medal must contain 92.5 percent silver",
  "There are 240 dots on an arcade Pac-Man game",
  "The San Francisco Cable cars are the only mobile National Monuments",
  "Lee Harvey Oswald's cadaver tag sold at an auction for $6,600 in 1992.",
  "A pound of houseflies contains more protein than a pound of beef",
  "The average American works 24,000 hours in their lifetime just to pay their taxes",
  "The U.S. military operates 234 golf courses",
  "40% of all people who come to a party in your home snoop in your medicine cabinet",
  "A duck's quack doesn't echo, and no one knows why.",
  "Non-dairy creamer is flammable.",
  "Pinocchio is Italian for \"pine head.\"",
  "There are more than 10 million bricks in the Empire State Building.",
  "The sun is 330,330 times larger than the earth.",
  "Polar bear fur is actually clear, and their skin is black.",
  "Baby flamingos are born grey, not pink.",
  "A woodpecker's tongue actually wraps all the way around its brain, protecting it from damage when it's hammering into a tree.",
  "A shrimp's heart is located in its head.",
  "Elephants suck on their trunks for comfort.",
  "Anteaters have no teeth.",
  "Nine-banded armadillos always have quadruplets, and they're always identical.",
  "Wombat poop is cube-shaped.",
  "A flock of flamingos is called a flamboyance.",
  "Hippos and horses are actually distant relatives.",
  "All clownfish are born male.",
  "In the UK, The Queen legally owns all unmarked swans.",
  "To keep from drifting apart, sea otters hold hands while they sleep.",
  "Goats have accents.",
  "Dolphins give names to each other.",
  "Gorillas can catch human colds - you're probably still safe to go to the zoo with the sniffles, though.",
  "Forget bald eagles. The turkey was once almost named the national bird.",
  "A group of owls is called a parliament.",
  "There are 32 muscles in a cat's ear.",
  "Snails can regenerate their eyes.",
  "Want to know if your pet turtle is a boy or girl? Listen closely! Female turtles hiss and male turtles grunt.",
  "A starfish can turn its stomach inside out.",
  "French Poodles are actually from Germany.",
  "Seahorses mate for life and can often be seen holding each other's tales.",
  "A group of porcupines is called a prickle.",
  "Andrew Jackson's parrot had to be removed from his funeral because it wouldn't stop swearing. Polly wants her mouth washed out.",
  "Sloths can hold their breaths for up to 40 minutes.",
  "Henry VIII knighted all four of his \"Grooms of Stool\" - the people in charge of wiping his butt for him.",
  "Jeannette Rankin was elected to Congress four years before women could even vote.",
  "Women couldn't apply for credit at a bank until 1974.",
  "Before the invention of modern false teeth, dentures were commonly made from the teeth of dead soldiers.",
  "In ancient Egypt, servants were smeared with honey so flies would flock to them instead of the pharaoh.",
  "It was once considered sacrilegious to use a fork.",
  "Abe Lincoln was a champion wrestler. He was also a licensed bartender. Maybe they should call him an \"Abe of all trades.\"",
  "George Washington owned a whiskey distillery.",
  "More than two percent of the American population was killed during the Civil War.",
  "Joseph Stalin used to have people removed from photos after they died or were removed from office.",
  "Since 1945, all British tanks have been equipped with the necessary items for making tea.",
  "Pope Gregory IV once declared war on cats because he believed Satan used black cats. His declaration lead to the mass extermination of cats.",
  "That lack of cats led to a rat infestation which led to the spread of the plague.",
  "John Adams was the first president to live in the White House.",
  "Go to bed! Chernobyl, the Exxon Valdez Oil Spill, and the Challenger explosion have all been attributed to a lack of sleep.",
  "The average person living in Sweden eats about 22 pounds of chocolate a year.",
  "While the Wright Brothers are famous as a pair, they actually only flew together once. They promised their father they'd always fly separately.",
  "Montana has three times as many cows as it does people.",
  "Parts of the Great Wall of China were made with sticky rice.",
  "Ninety percent of the world's population lives above the equator.",
  "Finland has more saunas than cars.",
  "Sixty percent of the World's lakes (three million total) are located in Canada.",
  "Virginia is the only state that has the same state flower and state tree, the Dogwood.",
  "Think before you season. In Egypt, it's considered incredibly rude to salt food that has been served to you.",
  "Ninety percent of Libya is desert.",
  "The height of the Eiffel Tour can vary up to six inches, depending on the temperature.",
  "Spend too much on drinks when you eat out? A small town in Italy actually has a fountain that serves free wine.",
  "Pilots and their co-pilots are required to eat different meals before flights so that they don't both end up with food poisoning.",
  "Roughly 600 Parisians work at the Eiffel Tower each day.",
  "Want to go to Rome? Which one? There's a city named Rome on six out of seven continents. (You really dropped the ball, Antarctica.)",
  "When visiting Key West, you're actually closer to Havana than you are to Miami.",
  "Mary, of \"Mary Had A Little Lamb\" fame, was a real person and the song is based on a true story.",
  "\"Happy Birthday\" was the first song ever played on Mars. Mars Rover Curiosity played the song to itself on its first anniversary on the planet.",
  "While listening to music, your heart can sync to the rhythm.",
  "President Nixon was an accomplished musician. He played five instruments, including the accordion.",
  "Got a song stuck in your head? That's called an \"earworm.\"",
  "None of The Beatles could actually read music.",
  "However, George Harrison could reportedly play 26 instruments.",
  "Barry Manilow did not, in fact, write \"I Write The Songs.\"",
  "Metallica is the only band to perform on all seven continents.",
  "Most department stores tend to play slower music, in order to slow down customers and keep them shopping longer. The opposite is true for restaurants.",
  "Monaco's orchestra is bigger than its army.",
  "A concert promoter once sold a thousand tickets to a Spice Girls concert in Hawaii that was never actually booked. Maybe that's where they got the idea for Fyre Fest.",
  "Leo Fender, the inventor of the Stratocaster and the Telecaster, couldn't play guitar.",
  "In 2016, Mozart sold more albums than Beyoncé.",
  "During a fundraiser for Hurricane Katrina relief efforts, someone donated $35,000 so that VH1 Classic would have to play \"99 Luftballons\" on repeat for an entire hour.",
  "\"A Boy Named Sue\" wasn't written by Johnny Cash. Shel Silverstein wrote it.",
  "In 2015, Belfast police used ice cream truck music to deter teenage rioters.",
  "Gatorade was named after the University of Florida Gators.",
  "China didn't win its first Olympic medal until 1984.",
  "The average golf ball has 336 dimples.",
  "Tennis was originally played with bare hands.",
  "The Cleveland Browns are the only team to neither play in or host a Super Bowl.",
  "Wilt Chamberlain is in the Volleyball Hall of Fame.",
  "Some golf balls are filled with honey.",
  "Despite taking about three hours to play out, the average baseball game only has about 18 minutes of active playing time.",
  "MLB umpires are required to wear black underwear in case they split their pants.",
  "Bo Jackson refused the teams that originally tried to draft him in both baseball and football.",
  "Both volleyball and basketball were invented in Massachusetts.",
  "Michael Jordan and the Chicago Bulls once went eight seasons (starting in 1990) without a three-game losing streak.",
  "NFL refs also get Super Bowl rings.",
  "President Hubert Hoover invented a game called \"Hooverball\" which was a cross between tennis and volleyball and was played with a medicine ball.",
  "Only one city has won three major championships in one year. In 1935, the Detroit Lions won the Super Bowl, the Tigers won the world series, and the Red Wings won the Stanley Cup.",
  "More than 100 baseballs are used during a typical professional baseball game.",
  "You can't hum while plugging your nose.",
  "Tomatoes have more genes than humans.",
  "We're one to two centimeters taller in the morning than at night.",
  "One quarter of all our bones are in our feet.",
  "The human body contains enough fat to make about seven bars of soap.",
  "You can't lick your elbow.",
  "You can't tickle yourself.",
  "By the time we die, we'll have spent roughly a year sitting on the toilet.",
  "You are always looking at your nose; your brain just chooses to ignore it.",
  "Astronauts can grow up to two inches taller while they're in space.",
  "Some blood vessels in a blue whale are actually big enough for humans to swim through.",
  "We're the only species known to blush.",
  "You only breathe out of one nostril at a time.",
  "Babies are born with more bones than adults. (Babies have 300 bones while adults only have 206.)",
  "Most newborns lose all the hair they were born with by the time they're six months old.",
  "It's impossible to burp in space.",
  "Everyone has their own unique smell, except identical twins.",
  "Thumbs have their own pulse.",
  "Goosebumps developed to make our ancestors' hair stand up, making them appear more threatening to predators.",
  "A sneeze shoots through the air at 100 miles per hour, sending 10,000 germs flying.",
  "Know how a bat or whale uses echolocation to communicate? Humans are also capable of echolocation.",
  "Stomach acid is strong enough to dissolve metal.",
  "The longest hiccuping spell lasted a whopping 68 years.",
  "Guide dogs do their \"business\" on command - to make things easier for their owners. So considerate!",
  "In WWII British soldiers had to make do with only three sheets of toilet paper per day!",
  "In Russia, beer was considered a soft drink, not alcohol, until 2011!",
  "Strawberries are NOT berries, but bananas actually are!",
  "A tomato is actually a fruit.",
  "The cashew nuts we eat are actually attached to a large cashew apple that is used to make soft drinks in Brazil. Ca-shew on that fact!",
  "Mice actually do not like cheese! They prefer sweets if given the choice - they like to eat fruit, seeds, and grains!",
  "Turkey was probably not eaten at the first Thanksgiving - instead, wildfowl, goose, and even possibly… passenger pigeons and swans were consumed!",
  "A flock of ravens is called a conspiracy. Dark stuff!",
  "Caterpillars have 12, count ‘em, 12 eyes!",
  "Mice have pretty funny names: A female mouse is a doe and a male mouse is a buck. Baby mice are sometimes called pinkies because of their color and sometimes called pups.",
  "Did you know that gorillas, monkeys, bonobos, and other primates make a new nest to sleep in every night?!",
  "Chickens don't just eat seeds, they like to eat insects and also mice and lizards! Ew, chickens!",
  "Giraffes don't just have long necks: They have long tongues! Their tongues are between 18 and 20 inches long.",
  "In Arizona, you can't feed garbage to pigs without getting a permit.",
  "Sea otters like to hold each other's paws when they sleep, so they don't drift apart while dreaming. How sweet is that?!",
  "Did you know that jellyfish have been around even before dinosaurs?",
  "All clownfish are born male! They can also all change their sex to female, but they can't turn it back to male after doing so. So Nemo could become a girl fish all along!",
  "Did you know apples come from the same plant family as roses? So do plums, raspberries, and many other delicious fruits. Next time, instead of roses, just send your mother a lovely bouquet of plums!",
  "The first Akita dog came to this country in 1937 - as a present for Helen Keller!",
  "Turns out, a dog's paw print is just as unique as a human's. Good news for dog detectives!",
  "A camel can drink up to 40 gallons of water in one go. That's seriously impressive!",
  "Don't bring your crystal ball to Maryland! Fortune telling is illegal in the state.",
  "Speaking of ferrets, did you know they used to be used to protect grain stores from rodents?",
  "The technical term for a fear of long words is \"\"hippopotomonstrosesquippedaliophobia.\" No way you can self-diagnose yourself with that one!",
  "The White House has 35 bathrooms. So every bathroom break can be different for POTUS!",
  "Greyhounds can run up to 45 mph. So don't challenge one to a race!",
  "Hiking naked is illegal in Switzerland. Though we must say, it doesn't seem like a good idea in general!",
  "A flock of flamingos is called… wait for it… a flamboyance! Fancy.",
  "New York's Central Park is bigger than Monaco. That's right, one park is bigger than an entire country!",
  "Using ferrets to hunt other animals is illegal in West Virginia. Good to know!",
  "Don't let the chicken cross the road in Georgia (the country.) No, seriously. It's illegal!",
  "Here's a fact to sit on: there are over 9,000 benches in Central Park.",
  "Theodore Roosevelt's kids had a pet bear, badger, and hyena, to name but a few animals - and they brought them all to the White House!",
  "There are over 700 ancient Egyptian hieroglyphic symbols. That's a lot compared to 26 letters of alphabet!",
  "A woodpecker's tongue is bigger than its entire head. It keeps it wrapped up around its brain to protect it from the impact of all that pecking!",
  "Saturn's surface is less dense than water. That means it could float in your bathtub - if it were big enough.",
  "The expression \"heart of gold\" was invented by Shakespeare.",
  "To make one pound of honey, a bee has to fly 90,000 miles! Though one bee typically only makes one twelfth of a teaspoon of the stuff in its lifetime.",
  "Some lipsticks apparently contain fish scales. Eek!",
  "An ostrich's eye is actually bigger than its brain.",
  "The United States apparently makes 25 percent of the world's cheese. That's a whole lot of cheese!",
  "Here's one to tickle your funny bone: the human hand has 54 bones. That's more than a quarter of the bones in the whole body. Wow!",
  "Want a license plate in the shape of a polar bear? All you have to do is move to Nunavut Province in Canada!",
  "How do you tell if a cranberry is ripe? It'll bounce like a rubber ball.",
  "Most U.S. stamp adhesive contains about one-tenth of a calorie. British stamps could set you back 5.9 calories. Of course, one lick won't transfer all of that to your belly.",
  "Here's a little funny and creepy fact: not only are groups of crows called murders, but the birds actually hold funerals for their dead. Spooky!",
  "Bees are the only insect that produce food that people eat. Thanks, bees!",
  "Squeamish? Don't go to any cheese shops in Sardinia, lest you find yourself face to face with Casu Marzu, a cheese that gets its taste from live maggots. Eek!",
  "Lettuce is a member of the sunflower family. Is your mind blown?",
  "Jin Songhao of China won the world record for longest skin contact with snow at 46 minutes and 7 seconds!",
  "The heaviest onion on record was grown by Pete Glazebrook of England. It weighed 17 pounds!",
  "The title of tallest Mohawk goes to Kazuhito Watanabe, a Japanese fashion designer. His ‘hawk' measures three feet 8.6 inches!",
  "Elmer Fudd's original name was Egghead.",
  "The actors who voiced Mickey and Minnie mouse from the 1980s to the 2010s were married!",
  "In some Harry Potter movie scenes where Harry, Ron, and Hermione are doing their Hogwarts schoolwork, the actors were actually doing their REAL schoolwork!",
  "Forgetful? Move to Eastern Pennsylvania where the word \"jawn\" can be used to a person, place, or thing you just can't remember.",
  "The oldest domestic cat on record lived for 38 years. She was Creme Puff of Austin, Texas.",
  "Apparently, the world's fastest ant runs faster than Usain Bolt!",
  "Little brown bats make for the longest nappers - in captivity, they nap up to 19.9 hours a day. Wish we could take a nap that long!",
  "The longest noodle ever made is more than 10,000 feet long. That's almost two miles! Wonder how long it would take us to slurp that?",
  "Otto the bulldog broke the record for dog to skate through the longest human tunnel when he skated through the legs of 30 people without any assistance. Otto, you're our hero.",
  "A flock of peacocks is called a party. Party hard, peacocks!",
  "The Supreme Court has its own basketball court, with a great nickname: \"The highest court on the land!\" Get it?!",
  "Time stops at the speed of light.",
  "The average human body carries more bacteria cells than human cells.",
  "In their lifetime, the average person walks the equivalent of five times around the Earth.",
  "Humans wouldn't be able to taste food without saliva.",
  "If Betelgeuse exploded right now, the star's last light show would brighten our sky for around two months.",
  "Oona Chaplin, who played Robb Stark's wife in Game of Thrones, is Charlie Chaplin's granddaughter.",
  "The founder of sportswear companies Puma and Adidas were brothers! Rudolf \"Rudi\" Dassler is the brain behind Puma, while his big bro Adolf \"Adi\" Dassler gave the world Adidas.",
  "The only letter of the alphabet that doesn't appear in any American state is q.",
  "The original Ferris Wheel was designed and constructed in Chicago, Illinois, by George Washington Gale Ferris, Jr.",
  "While SPAM is most popular in Hawaii, it was actually invented in Minnesota. The state even serves as home to the SPAM museum!",
  "What percentage of DNA do humans share with bananas? This is evidence that humans are related to every other species on Earth. The genes of organisms that look very different are surprisingly similar. For example, human DNA sequences are over 95% identical to chimpanzee sequences and around 50% identical to banana sequences.",
  "Are there more chickens than people in the world? In fact, there are approximately 19 billion chickens in the world. That's almost three per person.",
  "When did braces come out? Orthodontic braces weren't invented until the early 1800s, but people's preoccupation with straight teeth, and/or proper jaw alignment dates back to the time of the ancient Egyptians.",
  "Are insects related to crustaceans? Like other arthropods, crustaceans have an exoskeleton, which they moult to grow. They are distinguished from other groups of arthropods, such as insects, myriapods and chelicerates, by the possession of biramous (two-parted) limbs, and by the nauplius form of the larvae.",
  "What causes the aurora? When charged particles from the sun strike atoms in Earth's atmosphere, they cause electrons in the atoms to move to a higher-energy state. When the electrons drop back to a lower energy state, they release a photon: light. This process creates the beautiful aurora, or northern lights."
]