[
  "There is no fun fact here.",
  "you're short.",
  "I love you.",
  "On average people fear spiders more than they do death.",
  "A crocodile cannot stick its tongue out.",
  "Table tennis balls have been known to travel off the paddle at speeds up to 160 km/hr. ",
  "'Go.' is the shortest complete sentence in the English language.",
  "A snail can sleep for three years.",
  "No word in the English language rhymes with 'MONTH'",
  "The volume of the earth's moon is the same as the volume of the Pacific Ocean. ",
  "A cow has to eat grass to produce milk and grass is living.",
  "The cigarette lighter was invented before the match.",
  "The house fly hums in the middle octave key of F.",
  "Hydrogen gas is the least dense substance in the world, at 0.08988g/cc.",
  "The only capital letter in the Roman alphabet with exactly one end point is P. ",
  "Tigers have striped skin, not just striped fur. ",
  "A cat's jaw cannot move sideways.",
  "Hummingbirds are the only animals that can fly backwards. ",
  "If you yelled for 8 years, 7 months and 6 days you would have produced enough sound energy to heat one cup of coffee. (Hardly seems worth it)",
  "If you passed gas consistently for 6 years and 9 months, enough gas is produced to create the energy of an atomic bomb.",
  "The human heart creates enough pressure when it pumps out to the body to squirt blood 30 feet.",
  "A pig's orgasm lasts 30 minutes. (In your next life do you want to be a pig?)",
  "A cockroach will live nine days without its head before it starves to death. ",
  "Banging your head against a wall uses 150 calories an hour. (Do not try this at home ..maybe at work)",
  "Some lions mate over 50 times a day.",
  "The catfish has over 27,000 taste buds. (What can be so tasty on the bottom of the pond?)",
  "The strongest muscle in the body is the tongue.",
  "Elephants are the only animal that cannot jump. (Please don't.)",
  "Rubber bands last longer when refrigerated. ",
  "Polar bears are left-handed (Who knew...? Who cares!)",
  "A cat's urine glows under a black light.",
  "An ostrich's eye is bigger than its brain.",
  "Starfish have no brains. (Neither do you dumbass.)",
  "This is a fun fact.",
  "Humans and dolphins are the only species that have sex for pleasure.",
  "Peanuts are one of the ingredients of dynamite. ",
  "The average person's left hand does 56% of the typing. (Unless you don't use QWERTY.)",
  "The shark is the only fish that can blink with both eyes. ",
  "There are more chickens than people in the world. ",
  "The longest one-syllable word in the English language is 'screeched.'",
  "No word in the English language rhymes with month, orange, silver, or purple.",
  "'Dreamt' is the only English word that ends in the letters 'mt.'",
  "Almonds are a member of the peach family. ",
  "There are only four words in the English language which end in 'dous': tremendous, horrendous, stupendous, and hazardous.",
  "A cat has 32 muscles in each ear.",
  "In most advertisements, the time displayed on a watch is 10:10. ",
  "A dragonfly has a life span of 24 hours.",
  "A goldfish has a memory span of three seconds.",
  "It's impossible to sneeze with your eyes open. (try it!)",
  "The giant squid has the largest eyes in the world. ",
  "The microwave was invented after a researcher walked by a radar tube and a chocolate bar melted in his pocket.",
  "The average person falls asleep in seven minutes.",
  "A rat can last longer without water than a camel.",
  "Your stomach has to produce a new layer of mucus every two weeks or it will digest itself.",
  "A 2\" X 4\" is really 1-1/2\" by 3-1/2\".",
  "A female ferret will die if it goes into heat and cannot find a mate.",
  "A raisin dropped in a glass of fresh champagne will bounce up and down continuously  from the bottom of the glass to the top.",
  "The original name for butterfly was flutterby.",
  "Roses may be red, but violets are indeed violet.",
  "Chewing gum while peeling onions will keep you from crying.",
  "Bats always turn left when exiting a cave.",
  "Astronauts are not allowed to eat beans before they go into space because passing wind in a space suit damages them. (The suits or the astronauts?)",
  "We ran out of fun facts.",
  "No number from 1 to 999 includes the letter \"a\" in its word form.",
  "Many oranges are actually green.",
  "The opposite sides of a die will always add up to seven.",
  "You are 13.8 percent more likely to die on your birthday.",
  "Playing dance music can help ward off mosquitoes.",
  "The King of Hearts is the only king in a deck of cards without a mustache.",
  "A Greek-Canadian man invented the \"Hawaiian\" pizza.",
  "Cats can’t taste sweet things because of a genetic defect.",
  "It’s possible to turn peanut butter into diamonds. (Doesn't mean you can do it.)",
  "A group of hippos is called a \"bloat.\"",
  "Pogonophobia is the fear of beards.",
  "The average adult spends more time on the toilet than they do exercising.",
  "Your fingernails grow faster on your dominant hand.",
  "Dragonflies have six legs but can't walk.",
  "Golf balls tend to have 336 \"dimples.\"",
  "Apple seeds contain cyanide.",
  "A cubic inch of human bone can bear the weight of five standard pickup trucks.",
  "A frigate bird can sleep while it flies.",
  "Jupiter is twice as massive as your mom.",
  "Your body contains about 100,000 miles of blood vessels.",
  "The average American spends about 2.5 days a year looking for lost items.",
  "If you plug your nose, you can't tell the difference between an apple, a potato, and an onion.",
  "The infinity sign is called a lemniscate.",
  "You can’t hunt camels in Arizona.",
  "Riding roller coasters can help you pass kidney stones.",
  "\"Spoonfeed\" is the longest English word with its letters in reverse alphabetical order.",
  "Octopuses and squid have three hearts.",
  "Ketchup was used medicinally in the early 1800s.",
  "You would likely \"mutate\" in space without a spacesuit.",
  "Space travel makes mice run in loops.",
  "The average American produces 4.5 pounds of trash per day. (You feel bad now huh.)",
  "Dolphins give each other names.",
  "Sloths can hold their breath for longer than dolphins.",
  "Sakyra horni",
  "Ravens know when someone is spying on them.",
  "You produce about six pounds of stool per week.",
  "Messages from your brain travel along your nerves at up to 200 miles per hour.",
  "This is the 100th fun fact!",
  "The average person has four to six dreams a night.",
  "The sun makes up more than 99 percent of our solar system's mass.",
  "According to the Bible, the chicken came before the egg.",
  "Flamingos can only eat with their heads upside down.",
  "Salt used to be a currency.",
  "Junk food is as addictive as drugs.",
  "It’s impossible to tickle yourself. (try it, you'll look dumb.)",
  "Venus is the only planet that rotates clockwise.",
  "Chalk is edible.",
  "A giraffe can go longer without water than a camel can.",
  "You spray 2.5 drops of saliva per word.",
  "Most American car horns honk in the key of F.",
  "Singing in a group boosts morale.",
  "Women see more colors than men. (It's obivious.)",
  "Women have more tastebuds than men. So there you go, another reason why women deserve chocolate more than men do.",
  "Nearly 10 percent of all dreams include sex.",
  "Bears don’t poop during hibernation.",
  "Animals that lay eggs don’t have belly buttons.",
  "Mosquitoes are attracted to people who just ate bananas.",
  "null",
  "undefined",
  "This fact was written by n1ko23",
  "This fact was written by azur",
  "This fact was written by geoxor ❱•❰",
  "You inhale oxygen and you exhale carbon dioxide!",
  "You die when you don't inhale.",
  "Now you're breathing manually.",
  "Now you're blinking manually.",
  "I never loved you. Stop dreaming",
  "I'm actually in your closet right now.",
  "Don't look behind you.",
  "Run.",
  "\"New car smell\" is the scent of dozens of chemicals.",
  "The world wastes about 1 billion metric tons of food each year. (We should reduce this! or I'll eat you)",
  "Hair and nails grow faster during pregnancy.",
  "Many feet bones don’t harden until you’re an adult.",
  "The heads on Easter Island have bodies.",
  "Goosebumps are meant to ward off predators.",
  "Pineapple works as a natural meat tenderizer.",
  "Humans are the only animals that blush.",
  "The feeling of getting lost inside a mall is known as the Gruen transfer.",
  "The wood frog can hold its pee for up to eight months.",
  "You lose up to 30 percent of your taste buds during flight.",
  "A chef’s toque contains 100 folds. It is said that these folds represent the number of ways to cook an egg.",
  "Rabbits can’t puke.",
  "The human body literally glows. It might be hard to see with your naked eye, but everyone you pass by every day is literally glowing. The human body emits a small quantity of visible light (“visible” in the technical sense - the illumination is about 1,000 times less intense than levels of light that we would actually be able to see).",
  "Cotton candy was invented by a dentist.",
  "Fingernails don’t grow after you die. (Just in case you didn't know)",
  "The English word with the most definitions is \"set.\"",
  "Pigeons can tell the difference between a painting by Monet and Picasso.",
  "Chewing gum boosts concentration.",
  "Space smells like seared steak.",
  "Bees sometimes sting other bees.",
  "The total weight of ants on earth once equaled the total weight of people.",
  "A pharaoh once lathered his slaves in honey to keep bugs away from him.",
  "Pringles aren't actually potato chips.",
  "Showers really do spark creativity.",
  "Water makes different pouring sounds depending on its temperature.",
  "Dogs like squeaky toys for a dark reason. Because dogs are descendants of wolves whose instincts include hunting smaller animals. The sound a squeaky toy makes is very similar to the sound a small animal makes when being hunted.",
  "According to YouTube statistics, only a small percentage of people who watch my videos are actually subscribed. So if you end up liking this video, consider subscribing. It's free and you can always unsubscribe. Enjoy the video.",
  "Most people break up on Mondays.",
  "Beethoven could still hear after going deaf. Beethoven discovered that if he bit onto a metal pole that connected to the piano he was playing, he could hear almost perfectly well. This process is called bone conduction.",
  "Stressed men have altered proclivities.",
  "You can always \"see\" your nose.",
  "Sharks existed before trees.",
  "Every time you shuffle a deck of cards, you probably get a combination that's never existed. The probability (52 factorial) that two card shuffles are exactly the same is so small, it likely will never happen.",
  "There is an immortal jellyfish. (Turritopsis dohrnii)",
  "Baby blue whales grow 200 pounds per day.",
  "The Twitter bird's official name Is Larry.",
  "There's a reason there's a hole in your pen caps. Because they're a choking hazard without them.",
  "Astronauts in space are exposed to the same amount of radiation as 150 to 6,000 chest x-rays.",
  "Beaver bum goo is occasionally used to enhance vanilla flavorings.",
  "Our sharpest memories are from early adulthood. Called \"the reminiscence bump.\"",
  "There's a peak cuteness for puppies.",
  "Only 18 out of 1 million Lego pieces are defective. That's out of the 20 billion pieces that are manufactured every year.",
  "There's only one human organ that naturally regenerates. Of all the organs in the human body, the liver is the only that can regenerate on its own.",
  "Your liver's size fluctuates significantly throughout the day.",
  "An astronaut was allergic to the moon. Harrison Schmitt, from the Apollo 17 mission, found out that he had a severe allergy to moon dust.",
  "Cows moo with regional accents.",
  "Vending machines are bigger threats to humanity than sharks.",
  "The blob of toothpaste that sits on your toothbrush has a name. It's called a \"nurdle.\"",
  "Tomatoes do have nicotine in them, While most people know that nicotine can be found in tobacco, low levels of the compound can be found in peppers, tomatoes and other members of the Solanaceae flowering plant family.",
  "Frog does not have external ears the eardrums (tympanic membranes) are directly exposed or may be covered by a layer of skin and are visible as a circular area just behind the eye.",
  "How many minutes do you boil an egg? Cook for a further minute if you like your soft boiled eggs a little firmer. For a hard-boiled egg, start the egg in cold water and bring up to the boil. Once the water is gently boiling, set the timer for between 7-10 minutes depending on how well cooked you like your eggs.",
  "You're reading this fun fact.",
  "You're having a good day",
  "You're having a bad day",
  "Is the moon a reflection of the sun? Of course, the light we see doesn't originate on the Moon -- the Moon (like the planets) shines by reflected sunlight. (The Moon's surface is actually quite black. Only about 3% of the Sun's light which hits the Moon is reflected. But that's enough to light up our night sky.)",
  "Are turkeys from Turkey? Though it is native to eastern Africa, the guinea fowl was imported to Europe through the Ottoman Empire and came to be called the turkey-cock or turkey-hen. When settlers in the New World began to send similar-looking fowl back to Europe, they were mistakenly called turkeys.",
  "Some fun facts don't make sense.",
  "Do bananas have seeds in them? Wild bananas, prior to domestication, do have seeds. But like seedless grapes, humans have found and cultivated seedless mutations. So now all banana trees come from cuttings and there are no seeds in the fruit. The little brown specs in a banana are the vestiges of seeds that did not develop because of the mutation.",
  "How many amps are in a bolt of lightning? Most measurements have been in the range 5,000 to 20,000 amps but a famous strike just before the Apollo 15 launch in 1971 was measured at 100,000 amperes by magnetic links attached to the umbilical tower. Currents over 200,000 amps have been reported.",
  "Do men snore more than women? The tongue, like other muscles, relaxes during sleep and it can then fall into this space, especially if we lie on our back, obstructing breathing or causing snoring. This space is larger in men than women, which may explain why men tend to snore while women are more likely to wake up.",
  "Why do you get on the left side of a horse? You have to go back to ancient times when horses were used as war mounts. Soldiers carry their swords on the left side (to reach with their right hand) and so they could only mount from the left or they would sit on their sword.",
  "How much oxygen is needed to survive? The air that is inhaled is about 20-percent oxygen, and the air that is exhaled is about 15-percent oxygen, so about 5-percent of the volume of air is consumed in each breath and converted to carbon dioxide. Therefore, a human being uses about 550 liters of pure oxygen (19 cubic feet) per day.",
  "Why do paper cuts hurt so much? Paper cuts can be surprisingly painful as they can stimulate a large number of skin surface nociceptors (pain receptors) in a very small area of the skin. Because the shallow cut does not bleed very much, the pain receptors are left open to the air, ensuring continued pain.",
  "What causes your heart to beat? The electrical system of your heart is the power source that makes this possible. The impulse starts in a small bundle of specialized cells located in the right atrium, called the SA node. The electrical activity spreads through the walls of the atria and causes them to contract. This forces blood into the ventricles.",
  "Do sharks take care of their young? The ones with pups that grow inside the mother have fewer babies at a time than sharks that lay eggs outside the body. Sharks do not care for their babies after they are born, but they do search for a safe place where they can lay their eggs or give birth.",
  "Do seagulls have taste buds? Birds depend less on the senses of smell and taste than people do. Most birds have little use for the sense of smell. The odors of food, prey, enemies or mates quickly disperse in the wind. Birds possess olfactory glands, but they're not well developed in most species, including the songbirds in our backyards.",
  "This is 201th fun fact. Yay! :D",
  "How many cells are there in an adult's body? The mean volume of a mammal cell is estimated to be 4 billionths of a cubic centimeter. (To get a sense of that size, check out The Scale of the Universe.) Based on an adult man's typical volume, you might conclude that the human body contains 15 trillion cells.",
  "opa",
  "Is a mushroom considered a fruit or vegetable? A mushroom is neither a fruit nor a vegetable technically mushrooms aren't even plants. They are a special type of fungus—a notion that puts some people off. If you don't mind the fungus part, though, mushrooms are a great addition to a healthy diet—not to mention totally delicious.",
  "Where does bubble tea come from? Bubble tea is a drink that originated in Taiwan in the 1980's and spread throughout Southeast Asia before finding its way to the US. Most of us think of bubble tea as being synonymous with boba tapioca pearls, but bubble tea was originally just a cold milk tea that was shaken until frothy.",
  "Space is completely silent. Why? There is no atmosphere in space, which means that sound has no medium or way to travel to be heard. Astronauts use radios to stay in communication while in space, since radio waves can still be sent and received.",
  "Nobody knows how many stars are in space. Do you?",
  "A full NASA space suit costs $12,000,000.",
  "Neutron stars can spin 600 times per second.",
  "One day on Venus is longer than one year.",
  "In 3.75 billion years the Milky Way and Andromeda galaxies will collide.",
  "If two pieces of the same type of metal touch in space they will permanently bond.",
  "The Sun’s mass takes up 99.86% of the solar system.",
  "The sunset on Mars appears blue.",
  "Cats can jump up to six times their length.",
  "Cats have 230 bones, while humans only have 206.",
  "Cats’ collarbones don’t connect to their other bones, as these bones are buried in their shoulder muscles.",
  "Cats’ claws all curve downward, which means that they can’t climb down trees head-first. Instead, they have to back down the trunk.",
  "Cats are supposed to have 18 toes (five toes on each front paw four toes on each back paw).",
  "Cats are nearsighted, but their peripheral vision and night vision are much better than that of humans.",
  "Cats have an extra organ that allows them to taste scents on the air, which is why your cat stares at you with its mouth open from time to time.",
  "Cats have whiskers on the backs of their front legs, as well.",
  "Cats have nearly twice the amount of neurons in their cerebral cortex as dogs.",
  "Cats have the largest eyes relative to their head size of any mammal.",
  "Cats make very little noise when they walk around. The thick, soft pads on their paws allow them to sneak up on their prey.",
  "Cats’ rough tongues can lick a bone clean of any shred of meat.",
  "Cats use their long tails to balance themselves when they’re jumping or walking along narrow ledges.",
  "Cats use their whiskers to “feel” the world around them in an effort to determine which small spaces they can fit into. A cat’s whiskers are generally about the same width as its body.",
  "Cats walk like camels and giraffes: They move both of their right feet first, then move both of their left feet. No other animals walk this way.",
  "Male cats are more likely to be left-pawed, while female cats are more likely to be right-pawed.",
  "Though cats can notice the fast movements of their prey, it often seems to them that slow-moving objects are actually stagnant.",
  "Some cats are ambidextrous, but 40 percent are either left- or right-pawed.",
  "Some cats can swim.",
  "There are cats who have more than 18 toes. These extra-digit felines are referred to as being \"polydactyl.\"",
  "Cats are crepuscular, which means that they’re most active at dawn and dusk.",
  "If you have 3 quarters, 4 dimes, and 4 pennies, you have $1.19. You also have the largest amount of money in coins without being able to make change for a dollar.",
  "The numbers '172' can be found on the back of the U.S. $5 dollar bill in the bushes at the base of the Lincoln Memorial.",
  "President Kennedy was the fastest random speaker in the world with upwards of 350 words per minute.",
  "In the average lifetime, a person will walk the equivalent of 5 times around the equator.",
  "Odontophobia is the fear of teeth.",
  "The 57 on Heinz ketchup bottles represents the number of varieties of pickles the company once had.",
  "In the early days of the telephone, operators would pick up a call and use the phrase, \"Well, are you there?\". It wasn't until 1895 that someone suggested answering the phone with the phrase \"number please?\"",
  "The surface area of an average-sized brick is 79 cm squared.",
  "According to suicide statistics, Monday is the favored day for self-destruction.",
  "Cats sleep 16 to 18 hours per day.",
  "The most common name in the world is Mohammed.",
  "It is believed that Shakespeare was 46 around the time that the King James Version of the Bible was written. In Psalms 46, the 46th word from the first word is shake and the 46th word from the last word is spear.",
  "Karaoke means \"empty orchestra\" in Japanese.",
  "The Eisenhower interstate system requires that one mile in every five must be straight. These straight sections are usable as airstrips in times of war or other emergencies.",
  "The first known contraceptive was crocodile dung, used by Egyptians in 2000 B.C.",
  "Rhode Island is the smallest state with the longest name. The official name, used on all state documents, is \"Rhode Island and Providence Plantations.\"",
  "When you die your hair still grows for a couple of months.",
  "There are two credit cards for every person in the United States.",
  "Isaac Asimov is the only author to have a book in every Dewey-decimal category.",
  "The newspaper serving Frostbite Falls, Minnesota, the home of Rocky and Bullwinkle, is the Picayune Intelligence.",
  "It would take 11 Empire State Buildings, stacked one on top of the other, to measure the Gulf of Mexico at its deepest point.",
  "The first person selected as the Time Magazine Man of the Year - Charles Lindbergh in 1927.",
  "The most money ever paid for a cow in an auction was $1.3 million.",
  "It took Leo Tolstoy six years to write \"War & Peace\".",
  "The Neanderthal's brain was bigger than yours is.",
  "On the new hundred dollar bill the time on the clock tower of Independence Hall is 4:10.",
  "Each of the suits on a deck of cards represents the four major pillars of the economy in the middle ages: heart represented the Church, spades represented the military, clubs represented agriculture, and diamonds represented the merchant class.",
  "The names of the two stone lions in front of the New York Public Library are Patience and Fortitude. They were named by then-mayor Fiorello LaGuardia.",
  "The Main Library at Indiana University sinks over an inch every year because when it was built, engineers failed to take into account the weight of all the books that would occupy the building.",
  "The sound of E.T. walking was made by someone squishing her hands in jelly.",
  "Lucy and Linus (who where brother and sister) had another little brother named Rerun. (He sometimes played left-field on Charlie Brown's baseball team, [when he could find it!]).",
  "The pancreas produces Insulin.",
  "1 in 5,000 north Atlantic lobsters are born bright blue.",
  "There are 10 human body parts that are only 3 letters long (eye hip arm leg ear toe jaw rib lip gum).",
  "A skunk's smell can be detected by a human a mile away.",
  "The word \"lethologica\" describes the state of not being able to remember the word you want.",
  "The king of hearts is the only king without a mustache.",
  "Henry Ford produced the model T only in black because the black paint available at the time was the fastest to dry.",
  "Mario, of Super Mario Bros. fame, appeared in the 1981 arcade game, Donkey Kong. His original name was Jumpman, but was changed to Mario to honor the Nintendo of America's landlord, Mario Segali.",
  "The three best-known western names in China: Jesus Christ, Richard Nixon, and Elvis Presley.",
  "Every year about 98% of the atoms in your body are replaced.",
  "Elephants are the only mammals that can't jump.",
  "The international telephone dialing code for Antarctica is 672.",
  "World Tourist day is observed on September 27.",
  "Women are 37% more likely to go to a psychiatrist than men are.",
  "The human heart creates enough pressure to squirt blood 30 feet (9 m).",
  "Diet Coke was only invented in 1982.",
  "There are more than 1,700 references to gems and precious stones in the King James translation of the Bible.",
  "When snakes are born with two heads, they fight each other for food.",
  "American car horns beep in the tone of F.",
  "Turning a clock's hands counterclockwise while setting it is not necessarily harmful. It is only damaging when the timepiece contains a chiming mechanism.",
  "There are twice as many kangaroos in Australia as there are people. The kangaroo population is estimated at about 40 million.",
  "Police dogs are trained to react to commands in a foreign language commonly German but more recently Hungarian.",
  "The Australian $5 to $100 notes are made of plastic.",
  "St. Stephen is the patron saint of bricklayers.",
  "The average person makes about 1,140 telephone calls each year.",
  "Stressed is Desserts spelled backwards.",
  "If you had enough water to fill one million goldfish bowls, you could fill an entire stadium.",
  "Mary Stuart became Queen of Scotland when she was only six days old.",
  "Charlie Brown's father was a barber.",
  "Flying from London to New York by Concord, due to the time zones crossed, you can arrive 2 hours before you leave.",
  "Dentists have recommended that a toothbrush be kept at least 6 feet (2 m) away from a toilet to avoid airborne particles resulting from the flush.",
  "You burn more calories sleeping than you do watching TV.",
  "A lion's roar can be heard from five miles away.",
  "The citrus soda 7-UP was created in 1929 \"7\" was selected because the original containers were 7 ounces. \"UP\" indicated the direction of the bubbles.",
  "Canadian researchers have found that Einstein's brain was 15% wider than normal.",
  "The average person spends about 2 years on the phone in a lifetime.",
  "The fist product to have a bar code was Wrigleys gum.",
  "The largest number of children born to one woman is recorded at 69. From 1725-1765, a Russian peasant woman gave birth to 16 sets of twins, 7 sets of triplets, and 4 sets of quadruplets.",
  "Beatrix Potter created the first of her legendary \"Peter Rabbit\" children's stories in 1902.",
  "In ancient Rome, it was considered a sign of leadership to be born with a crooked nose.",
  "The word \"nerd\" was first coined by Dr. Seuss in \"If I Ran the Zoo.\"",
  "A 41-gun salute is the traditional salute to a royal birth in Great Britain.",
  "The bagpipe was originally made from the whole skin of a dead sheep.",
  "The roar that we hear when we place a seashell next to our ear is not the ocean, but rather the sound of blood surging through the veins in the ear. Any cup-shaped object placed over the ear produces the same effect.",
  "Revolvers cannot be silenced because of all the noisy gasses which escape the cylinder gap at the rear of the barrel.",
  "Liberace Museum has a mirror-plated Rolls Royce jewel-encrusted capes, and the largest rhinestone in the world, weighing 59 pounds and almost a foot in diameter.",
  "A car that shifts manually gets 2 miles more per gallon of gas than a car with automatic shift.",
  "Cats can hear ultrasound.",
  "Dueling is legal in Paraguay as long as both parties are registered blood donors.",
  "The highest point in Pennsylvania is lower than the lowest point in Colorado.",
  "The United States has never lost a war in which mules were used.",
  "Children grow faster in the springtime.",
  "On average, there are 178 sesame seeds on each McDonalds BigMac bun.",
  "Paul Revere rode on a horse that belonged to Deacon Larkin.",
  "The Baby Ruth candy bar was actually named after Grover Cleveland's baby daughter, Ruth.",
  "Minus 40 degrees Celsius is exactly the same as minus 40 degrees Fahrenheit.",
  "Clans of long ago that wanted to get rid of unwanted people without killing them used to burn their houses down -- hence the expression \"to get fired\"",
  "Nobody knows who built the Taj Mahal. The names of the architects, masons, and designers that have come down to us have all proved to be latter-day inventions, and there is no evidence to indicate who the real creators were.",
  "Every human spent about half an hour as a single cell.",
  "7.5 million toothpicks can be created from a cord of wood.",
  "The plastic things on the end of shoelaces are called aglets.",
  "A 41-gun salute is the traditional salute to a royal birth in Great Britain.",
  "The earliest recorded case of a man giving up smoking was on April 5, 1679, when Johan Katsu, Sheriff of Turku, Finland, wrote in his diary \"I quit smoking tobacco.\" He died one month later.",
  "\"Goodbye\" came from \"God bye\" which came from \"God be with you.\"",
  "Jane Barbie was the woman who did the voice recordings for the Bell System.",
  "The first drive-in service station in the United States was opened by Gulf Oil Company - on December 1, 1913, in Pittsburgh, Pennsylvania.",
  "The elephant is the only animal with 4 knees.",
  "Kansas state law requires pedestrians crossing the highways at night to wear tail lights.",
  "I look like a dad"
]
