[
  "Welcome to Hell! My name's Naoko!",
  "Ayy! Welcome! ⊂(◉‿◉)つ",
  "(∩｀-´)⊃━☆ﾟ.*・｡ﾟ You have been summoned into this server!",
  "Hello there! (✿◡‿◡)",
  "Meow! ฅ^◕ﻌ◕^ฅ",
  "Greetings newcomer ლ(●ↀωↀ●)ლ",
  "Not sure how you found your way here, but greetings! (✿◠‿◠)",
  "Welcome to the server! Hope you have a great time here! (ɔ◔‿◔)ɔ :hearts:",
  "Welcome newcomer, glad you joined the server! ლ(´ڡ`ლ)",
  "Finally (ﾉ･ｪ･)ﾉ You're awake (/^▽^)/",
  "Welcome, make sure to read the #rules-info and i hope you have a nice time hereヾ(^▽^*)))",
  "(っ＾▿＾)۶:cocktail::star2::beer:٩(˘◡˘ ) Cheers and welcome!",
  "Hi, how's it going? Actually idc, but welcome to the server!",
  "Welcome, let's put up our best smile! ｡◕‿‿◕｡",
  "Welcome to the official ::GUILD_NAME discord server! I am Naoko and I'll be your guide! (✿◠‿◠)",
  "Finally a new face! (ง°ل͜°)ง",
  "(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ Yay a new member! ✧ﾟ･: *ヽ(◕ヮ◕ヽ)",
  "Oh, I haven't seen you before! Are you a new member?（‐＾▽＾‐）",
  "NOOOOOOOOOO! (ﾒ` ﾛ ´)︻デ═一",
  "(▀̿Ĺ̯▀̿ ̿) WELCOME TO THE SERVER. FOLLOW THE RULES OR BAD THINGS WILL HAPPEN.",
  "A new member has arrived! (/^▽^)/ What was your name again?",
  "Welcome New User-Kun o(>ω<)o Enjoy your stay!",
  "Hewwo, wewcome to the ::GUILD_NAME sewvew OwO",
  "Welcome! Little did u know i'm inside your closet! ↑_(ΦwΦ)Ψ",
  "i should stop joking around man xD",
  "Hello! Feel free to talk to other members, they are great! (kinda...)",
  "Oh wow, a new member! (*≧▽≦) Welcome!",
  "Who's that in the distance, hmmm wait its a new comer! welcome!!!! (^///^)",
  "(^・ω・^ )/ Welcome friend!",
  "Ah a new pretty face! ଲ(ⓛ ω ⓛ)ଲ",
  "We attracted another new member? Score! How's it going?",
  "Look! It's a new member! ‧⁺◟( ᵒ̴̶̷ ·̫ ᵒ̴̶̷ )",
  "【・_・?】Huh? Who are you?",
  "Well hello there! /╲/╭( ͡°͡° ͜ʖ ͡°͡°)╮/╱\\",
  "A new challenger approaches! (⌒⃝৺⌒⃝)",
  "Boo! did i scare ya haha, anyways welcome!",
  "(」｡≧□≦)」HI NEW MEMBER! HOW ARE YOU THIS FINE DAY!",
  "Other people exist? Other people exist! And they're here! Yay!",
  "So? DId you bring us our pizza we ordered?",
  "Welcome! Don't be shy! ╭[☉﹏☉]╮",
  "Was it just me or... Hold on.. Have we met before? No? So you're new! Welcomee!!! ✧٩(•́⌄•́๑)و ✧",
  "Another person?! ╭(ఠఠ益ఠఠ)╮",
  "Σ(‘Д’⁕)ահɑԵ’Տ up !?",
  "Poggers, a new member has arrived! ٩(●ᴗ●)۶",
  "ヾ(｡ꏿ﹏ꏿ)ﾉﾞWoah! I didn't see you there! Anyways, welcome to the server!",
  "（╯°□°）╯︵( .o.) AAA! ... Sorry, you scared me, new member! Welcome!",
  "Hello there! i had a fucking terrible day but i hope you have a nice day. (#_<-)",
  "♪♪＼(^ω^＼) A new person has joined! Time to do the new member dance! ( /^ω^)/♪♪",
  "I do feel nervous when I meet new people, but welcome! ヾ(≧∪≦*)ノ〃",
  "This party got another member again! ٩(ó｡ò۶ ♡)))♬ Welcome!",
  "～(m~ー~)m ooOOOooOOOOoo, I'm a ghost that haunts new members!",
  "And now I present to you.... this new member. 彡(-_-;)彡",
  "Greetings!ヽ(^◇^*)/ Have a great day!",
  "Congrats! You got a this welcome quote out of (idk how many)!",
  "“ψ(｀∇´)ψ A newcomer! Muahahaha! Come here so I can murder you with welcome hugs!",
  "Wait, what if we took the positive / neutral mona bot answers and just tweaked tehm?",
  "Hoho! Do I see a new face around here? ٩| ര ‿ ര |╯",
  "Never gonna not welcome you, never gonna hate you, i hope you have a great stay here! ♫♫♫",
  "nah but like the one that's like *whoosh* *shum* *magical noises* could be tweaked into a welcome quote",
  "Look at that, it's a new member! ლ(꒪ヮ꒪)ლ",
  "Someone make this alot better k thx",
  "ᕙ(° ͜ಠ ͜ʖ ͜ಠ°)ᓄ WELCOME. HOPE YOU READ THE #rules-info BEFORE CHATTING.",
  "Oh boy I am hungry! Hey! A new member! ٩(｡•ω•｡)و Did you bring some food with you?",
  "ᗜಠ o ಠ)¤=[]:::::> Welcome, new member! It is I, Warrior Naoko, here to guide you to #rules-info before chatting here!",
  "You're always welcomed, and you're always loved! Enjoy your stay! ♫♫♫",
  "I see a new member approaching! ٩(๑❛ワ❛๑)و Hello!",
  "Welcome! Please enjoy the ::GUILD_NAME community!"
]
